{
    "claims": [
        {
            "claimNumber": 1,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 1, Monroe discloses a radio front-end (see Fig. 2 and paragraph 0032, where Monroe describes a radio frequency (RF) transceiver 250 that is connected to a transmit-receive (T/R) switch 255), comprising: a transmit path comprising a power amplifier (see Fig. 3 and paragraph 0035, where Monroe describes that the transmit path of the RF transceiver 250 comprises a power amplifier 302); a receive path comprising a low-noise amplifier (see Fig. 3 and paragraph 0035, where Monroe describes that the receive path of the RF transceiver 250 comprises a low-noise amplifier 303); and a transmit/receive switch configured to connect the transmit path and the receive path to an antenna (see Fig. 3 and paragraph 0039, where Monroe describes the T/R switch 255 connects the transmit path and the receive path to an antenna 260), the transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier (see Fig. 3 and paragraph 0037, where Monroe describes that a quarter-wave transmission line 330 is connected in parallel with the power amplifier 302), said first switched reactive impedance having an impedance (see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode). Monroe discloses that the output of the power amplifier is connected to a quarter-wave transmission line which is an impedance inverter (see Fig. 3 and paragraph 0037) without specifically disclosing that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier. Mei teaches that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier (see Fig. 1 and paragraph 0006, where Mei describes that the output of a power amplifier 2 is directed to an inverting impedance matching network that is a quarter-wave transmission line, which transforms the output impedance of the power amplifier to a desired impedance, thus neutralization). Therefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005)."
                }
            ]
        },
        {
            "claimNumber": 2,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 2, Monroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a plurality of independently switched impedances arranged in parallel (see Fig. 3 and paragraph Monroe describes an inductor 350 and a pin diode 335 that are arranged in parallel)."
                }
            ]
        },
        {
            "claimNumber": 3,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 3, Monroe in view of Mei discloses the invention of claim 1 above. Monroe discloses the first switched reactive impedance is switched on during a reception stage (see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode) and switched off during a transmission stage (see paragraph 0037, where Monroe describes that the quarter-wave transmission line 330 is an open circuit during transmit mode)."
                }
            ]
        },
        {
            "claimNumber": 4,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 4, Monroe in view of Mei discloses the invention of claim 1 above. Monroe discloses the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch (see Fig. 3 and paragraph 0039, where Monroe describes the transmit path 399 in which the transmit signal enters circulator 310 on the way to antenna 260)."
                }
            ]
        },
        {
            "claimNumber": 5,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 5, Monroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier (see Fig. 1A and paragraph 0005, where Monroe describes that during receive periods, a quarter-wave transmission line 155 and the pin-diode 160 in parallel with the LNA input impedance present a 50 ohm impedance)."
                }
            ]
        },
        {
            "claimNumber": 6,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 6, Monroe in view of Mei discloses the invention of claim 1 above. Monroe discloses a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna (see Fig. 6 and paragraph 0042, where Monroe describes a quarter-wave transmission line 605 connecting the low-noise amplifier 303 to the antenna 260)."
                }
            ]
        },
        {
            "claimNumber": 7,
            "parentClaim": 6,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 7, Monroe in view of Mei discloses the invention of claim 6 above. Monroe discloses a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission (see Fig. 3 and paragraph 0037, where Monroe describes a pin diode 335 that is connected to ground, which is on and appears as a short circuit during transmit mode)."
                }
            ]
        },
        {
            "claimNumber": 8,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 8, Monroe discloses a method for radio control (see Fig. 2 and paragraph 0032, where Monroe describes a radio frequency (RF) transceiver 250), comprising: connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception (see Fig. 3 and paragraph 0037, where Monroe describes that a quarter-wave transmission line 330 is connected in parallel with the power amplifier 302; see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode) to prevent received signals from entering the transmit path (see Fig. 5 and paragraph 0041, where Monroe describes that the received RF signals enter antenna 260 and flow through circulators 310 and 315 as indicated by dotted line 599 to the low noise amplifier 303); and disconnecting the first reactive impedance during transmission (see paragraph 0037, where Monroe describes that the quarter-wave transmission line 330 is an open circuit during transmit mode). Monroe discloses that the output of the power amplifier is connected to a quarter-wave transmission line which is an impedance inverter (see Fig. 3 and paragraph 0037) without specifically disclosing that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier. Mei teaches that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier (see Fig. 1 and paragraph 0006, where Mei describes that the output of a power amplifier 2 is directed to an inverting impedance matching network that is a quarter-wave transmission line, which transforms the output impedance of the power amplifier to a desired impedance, thus neutralization). Therefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005)."
                }
            ]
        },
        {
            "claimNumber": 9,
            "parentClaim": 8,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 9, Monroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a plurality of independently switched impedances arranged in parallel (see Fig. 3 and paragraph Monroe describes an inductor 350 and a pin diode 335 that are arranged in parallel)."
                }
            ]
        },
        {
            "claimNumber": 10,
            "parentClaim": 9,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 10, Monroe in view of Mei discloses the invention of claims 9 and 16 above. Monroe does not specifically disclose connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. Mei teaches connecting a set of independently switched impedances selected to most closely match the reactive impedance of the power amplifier (see Fig. 1 and paragraphs 0005-0006, where Mei describes that the inverting impedance matching network matches the output impedance of the power amplifier Z1 to an impedance Z2). Therefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005)."
                }
            ]
        },
        {
            "claimNumber": 11,
            "parentClaim": 10,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246",
                        "US 20120280754"
                    ],
                    "reason": "Regarding Claim 11, Monroe in view of Mei discloses the invention of claim 10 above. Monroe does not specifically disclose measuring the reactive impedance of the power amplifier. Bank teaches measuring the reactive impedance of the power amplifier (see claim 7, where Gorbachov describes the reactive impedance of a power amplifier is approximately 0 Ohms). Therefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include measuring the reactive impedance of the power amplifier, as taught by Gorbachov to modify the method of Monroe in order to improve primary performance parameters, as discussed by Gorbachov (see paragraph 0070)."
                }
            ]
        },
        {
            "claimNumber": 12,
            "parentClaim": 8,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 12, Monroe in view of Mei discloses the invention of claim 8 above. Monroe discloses setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line (see Fig. 7 and paragraph 0044, where Monroe describes that a pin diode 705 is on during transmit mode)."
                }
            ]
        },
        {
            "claimNumber": 13,
            "parentClaim": 12,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 13, Monroe in view of Mei discloses the invention of claim 12 above. Monroe discloses setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low-noise amplifier and the one-quarter wavelength transmission line (see Fig. 5 and paragraph 0041, where Monroe describes the receive mode)."
                }
            ]
        },
        {
            "claimNumber": 14,
            "parentClaim": 8,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 14, Monroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier (see Fig. 1A and paragraph 0005, where Monroe describes that during receive periods, a quarter-wave transmission line 155 and the pin-diode 160 in parallel with the LNA input impedance present a 50 ohm impedance)."
                }
            ]
        },
        {
            "claimNumber": 15,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 15, Monroe discloses a method for radio control (see Fig. 2 and paragraph 0032, where Monroe describes a radio frequency (RF) transceiver 250), comprising: connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception (see Fig. 3 and paragraph 0037, where Monroe describes that a quarter-wave transmission line 330 is connected in parallel with the power amplifier 302; see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode) to prevent received signals from entering the transmit path (see Fig. 5 and paragraph 0041, where Monroe describes that the received RF signals enter antenna 260 and flow through circulators 310 and 315 as indicated by dotted line 599 to the low noise amplifier 303); and disconnecting the first reactive impedance during transmission (see paragraph 0037, where Monroe describes that the quarter-wave transmission line 330 is an open circuit during transmit mode). Monroe discloses that the output of the power amplifier is connected to a quarter-wave transmission line which is an impedance inverter (see Fig. 3 and paragraph 0037) without specifically disclosing that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier. Mei teaches that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier (see Fig. 1 and paragraph 0006, where Mei describes that the output of a power amplifier 2 is directed to an inverting impedance matching network that is a quarter-wave transmission line, which transforms the output impedance of the power amplifier to a desired impedance, thus neutralization). Therefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005)."
                }
            ]
        },
        {
            "claimNumber": 16,
            "parentClaim": 15,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 16, Monroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a plurality of independently switched impedances arranged in parallel (see Fig. 3 and paragraph Monroe describes an inductor 350 and a pin diode 335 that are arranged in parallel)."
                }
            ]
        },
        {
            "claimNumber": 17,
            "parentClaim": 16,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 17, Monroe in view of Mei discloses the invention of claims 9 and 16 above. Monroe does not specifically disclose connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. Mei teaches connecting a set of independently switched impedances selected to most closely match the reactive impedance of the power amplifier (see Fig. 1 and paragraphs 0005-0006, where Mei describes that the inverting impedance matching network matches the output impedance of the power amplifier Z1 to an impedance Z2). Therefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005)."
                }
            ]
        },
        {
            "claimNumber": 18,
            "parentClaim": 15,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        "US 20050255810",
                        "US 20140253246"
                    ],
                    "reason": "Regarding Claim 18, Monroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier (see Fig. 1A and paragraph 0005, where Monroe describes that during receive periods, a quarter-wave transmission line 155 and the pin-diode 160 in parallel with the LNA input impedance present a 50 ohm impedance)."
                }
            ]
        }
    ]
}