{
    "id": 736,
    "abstract": "ABSTRACT  Transmit/receive switches and methods for radio control include connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path. The first reactive impedance is disconnected during transmission.  YO R920150782US2 (163-1085 CON) Page 20 of 20",
    "initialClaims": [
        "1. A radio front-end, comprising: a transmit path comprising a power amplifier; a receive path comprising a low-noise amplifier; and a transmit/receive switch configured to connect the transmit path and the receive path to an antenna, the transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier, said first switched reactive impedance having an impedance configured to neutralize a reactive impedance of the power amplifier. 2. The radio front-end of claim 1, wherein the first switched reactive impedance comprises a plurality of independently switched impedances arranged in parallel. 3. The radio front-end of claim 1, wherein the first switched reactive impedance is switched on during a reception stage and switched off during a transmission stage. 4. The radio front-end of claim 1, wherein the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch. 5. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier. 6. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna. 7. The radio front-end of claim 6, wherein the transmit-receive switch further comprises a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission. 8. A method for radio control, comprising: connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path; and disconnecting the first reactive impedance during transmission. 9. The method of claim 8, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel. 10. The method of claim 9, wherein connecting the first reactive impedance comprises connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. 11. The method of claim 10, further comprising measuring the reactive impedance of the power amplifier. 12. The method of claim 8, further comprising setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line. 13. The method of claim 12, further comprising setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low- noise amplifier and the one-quarter wavelength transmission line. 14. The method of claim 8, further comprising connecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier. 15. A system for radio control, comprising: a transmit/receive switch control configured to connect a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path and further configured to disconnect the first reactive impedance during transmission. 16. The system of claim 15, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel. 17. The system of claim 16, wherein the transmit/receive switch control is further configured to connect a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. 18. The system of claim 15, further wherein the transmit/receive switch control is further configured to connect a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier.",
        "2. The radio front-end of claim 1, wherein the first switched reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
        "3. The radio front-end of claim 1, wherein the first switched reactive impedance is switched on during a reception stage and switched off during a transmission stage.",
        "4. The radio front-end of claim 1, wherein the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch.",
        "5. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier.",
        "6. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna.",
        "7. The radio front-end of claim 6, wherein the transmit-receive switch further comprises a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission.",
        "8. A method for radio control, comprising: connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path; and disconnecting the first reactive impedance during transmission.",
        "9. The method of claim 8, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
        "10. The method of claim 9, wherein connecting the first reactive impedance comprises connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.",
        "11. The method of claim 10, further comprising measuring the reactive impedance of the power amplifier.",
        "12. The method of claim 8, further comprising setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line.",
        "13. The method of claim 12, further comprising setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low- noise amplifier and the one-quarter wavelength transmission line.",
        "14. The method of claim 8, further comprising connecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier.",
        "15. A system for radio control, comprising: a transmit/receive switch control configured to connect a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path and further configured to disconnect the first reactive impedance during transmission.",
        "16. The system of claim 15, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
        "17. The system of claim 16, wherein the transmit/receive switch control is further configured to connect a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.",
        "18. The system of claim 15, further wherein the transmit/receive switch control is further configured to connect a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier."
    ],
    "finalClaims": [
        "1. A radio front-end, comprising: a transmit path comprising a power amplifier; a receive path comprising a low-noise amplifier; and a transmit/receive switch configured to connect the transmit path and the receive path to an antenna, the transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier, said first switched reactive impedance having an impedance configured to neutralize that is opposite to a reactive impedance of the power amplifier.",
        "2. The radio front-end of claim 1, wherein the first switched reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
        "3. The radio front-end of claim 1, wherein the first switched reactive impedance is switched on during a reception stage and switched off during a transmission stage.",
        "4. The radio front-end of claim 1, wherein the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch.",
        "5. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier.",
        "6. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna.",
        "7. The radio front-end of claim 6, wherein the transmit-receive switch further comprises a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission.",
        "8. A method for radio control, comprising: connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception, the first reactive impedance having an impedance that is opposite to neutralize a reactive impedance of the power amplifier, and to prevent received signals from entering the transmit path; and disconnecting the first reactive impedance during transmission.",
        "9. The method of claim 8, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
        "10. The method of claim 9, wherein connecting the first reactive impedance comprises connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.",
        "11. The method of claim 10, further comprising measuring the reactive impedance of the power amplifier.",
        "12. The method of claim 8, further comprising setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low- noise amplifier and a one-quarter wavelength transmission line.",
        "13. The method of claim 12, further comprising setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low- noise amplifier and the one-quarter wavelength transmission line.",
        "14. The method of claim 8, further comprising connecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier.",
        "15. A system for radio control, comprising: a transmit/receive switch control configured to connect a first reactive impedance in parallel with a power amplifier on a transmit path during reception, the first reactive impedance being having an impedance that is opposite to neutralize a reactive impedance of the power amplifier, and to prevent received signals from entering the transmit path, the switch control being and further configured to disconnect the first reactive impedance during transmission.",
        "16. The system of claim 15, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
        "17. The system of claim 16, wherein the transmit/receive switch control is further configured to connect a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.",
        "18. The system of claim 15, further wherein the transmit/receive switch control is further configured to connect a second reactive impedance in parallel with a low- noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier."
    ],
    "CTNFDocumentIdentifier": "J13IQT8SRXEAPX3",
    "CTNFBodyText": "DETAILED ACTION\n\nThe present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA .\n\nDouble Patenting\nThe nonstatutory double patenting rejection is based on a judicially created doctrine grounded in public policy (a policy reflected in the statute) so as to prevent the unjustified or improper timewise extension of the “right to exclude” granted by a patent and to prevent possible harassment by multiple assignees. A nonstatutory double patenting rejection is appropriate where the conflicting claims are not identical, but at least one examined application claim is not patentably distinct from the reference claim(s) because the examined application claim is either anticipated by, or would have been obvious over, the reference claim(s). See, e.g., In re Berg, 140 F.3d 1428, 46 USPQ2d 1226 (Fed. Cir. 1998); In re Goodman, 11 F.3d 1046, 29 USPQ2d 2010 (Fed. Cir. 1993); In re Longi, 759 F.2d 887, 225 USPQ 645 (Fed. Cir. 1985); In re Van Ornum, 686 F.2d 937, 214 USPQ 761 (CCPA 1982); In re Vogel, 422 F.2d 438, 164 USPQ 619 (CCPA 1970); In re Thorington, 418 F.2d 528, 163 USPQ 644 (CCPA 1969).\nA timely filed terminal disclaimer in compliance with 37 CFR 1.321(c) or 1.321(d) may be used to overcome an actual or provisional rejection based on nonstatutory double patenting provided the reference application or patent either is shown to be commonly owned with the examined application, or claims an invention made as a result of activities undertaken within the scope of a joint research agreement. See MPEP § 717.02 for applications subject to examination under the first inventor to file provisions of the AIA  as explained in MPEP § 2159.  See MPEP §§ 706.02(l)(1) - 706.02(l)(3) for applications not subject to examination under the first inventor to file provisions of the AIA . A terminal disclaimer must be signed in compliance with 37 CFR 1.321(b). \nThe USPTO Internet website contains terminal disclaimer forms which may be used. Please visit www.uspto.gov/patent/patents-forms. The filing date of the application in which the form is filed determines what form (e.g., PTO/SB/25, PTO/SB/26, PTO/AIA /25, or PTO/AIA /26) should be used. A web-based eTerminal Disclaimer may be filled out completely online using web-screens. An eTerminal Disclaimer that meets all requirements is auto-processed and approved immediately upon submission. For more information about eTerminal Disclaimers, refer to www.uspto.gov/patents/process/file/efs/guidance/eTD-info-I.jsp.\nClaims 1-18 are rejected on the ground of nonstatutory double patenting as being unpatentable over claims 1-15 of U.S. Patent No. US 9,559,747 B1. Although the claims at issue are not identical, they are not patentably distinct from each other because:\nInstant Application: 15/173,034\nUS Patent: US 9,559,747 B1\n1.  A radio front-end, comprising: \n\na transmit path comprising a power amplifier;  \n\na receive path comprising a low-noise amplifier;  and \n\na transmit/receive switch configured to connect the transmit path and the receive path to an antenna, the transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier, said first switched reactive impedance having an impedance configured to neutralize a reactive impedance of the power amplifier. \n\n1.  A radio front-end, comprising: \n\na transmit path comprising a power amplifier;  \n\na receive path comprising a low-noise amplifier;  and \n\na transmit/receive switch configured to connect the transmit path and the receive path to an antenna, the transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier on the transmit path and a second switched reactive impedance in parallel with the low-noise amplifier on the receive path, said first switched reactive impedance having an impedance configured to neutralize a reactive impedance of the power amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive impedance of the low-noise amplifier, the transmit/receive switch being further configured to disconnect the second reactive impedance during reception. \n\n2.  The radio front-end of claim 1, wherein the first switched reactive impedance comprises a plurality of independently switched impedances arranged in parallel. \n\n2.  The radio front-end of claim 1, wherein the first switched reactive impedance comprises a plurality of independently switched impedances arranged in parallel. \n\n3.  The radio front-end of claim 1, wherein the first switched reactive impedance is switched on during a reception stage and switched off during a transmission stage. \n\n3.  The radio front-end of claim 1, wherein the first switched reactive impedance is switched on during a reception stage and switched off during a transmission stage. \n\n4.  The radio front-end of claim 1, wherein the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch. \n\n4.  The radio front-end of claim 1, wherein the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch. \n\n5.  The radio front-end of claim 1, wherein the transmit/receive switch further comprises \n\na second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier. \n\n1.  A radio front-end, comprising: \n……\n… and \na second switched reactive impedance in parallel with the low-noise amplifier on the receive path, …., said second switched reactive impedance having an impedance configured to neutralize a reactive impedance of the low-noise amplifier, ….. \n\n6.  The radio front-end of claim 1, wherein the transmit/receive switch further comprises a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna. \n\n5.  The radio front-end of claim 1, wherein the transmit/receive switch further comprises a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna. \n\n7.  The radio front-end of claim 6, wherein the transmit-receive switch further comprises a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission.\n\n6.  The radio front-end of claim 5, wherein the transmit-receive switch further comprises a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission.\n\n8.  A method for radio control, comprising: \n\nconnecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path; and  \n\n\n\n\n\n\ndisconnecting the first reactive impedance during transmission. \n7.  A method for radio control, comprising: \n\nconnecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path;  \n\nconnecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier;  \n\ndisconnecting the first reactive impedance during transmission;  and \n\ndisconnecting the second reactive impedance during reception. \n\n9.  The method of claim 8, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.\n\n8.  The method of claim 7, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.\n\n10.  The method of claim 9, wherein connecting the first reactive impedance comprises connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. \n\n9.  The method of claim 8, wherein connecting the first reactive impedance comprises connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. \n\n11.  The method of claim 10, further comprising measuring the reactive impedance of the power amplifier.\n\n10.  The method of claim 9, further comprising measuring the reactive impedance of the power amplifier.\n\n12.  The method of claim 8, further comprising setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line. \n\n11.  The method of claim 7, further comprising setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line. \n\n13.  The method of claim 12, further comprising setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low-noise amplifier and the one-quarter wavelength transmission line. \n\n12.  The method of claim 11, further comprising setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low-noise amplifier and the one-quarter wavelength transmission line. \n\n14.  The method of claim 8, further comprising \n\n\n\nconnecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier. \n\n7.  A method for radio control, comprising: \n\n…….;  \n\nconnecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier;  \n\n……... \n\n15.  A system for radio control, comprising: \n\na transmit/receive switch control configured to connect a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and \n\n\n\n\n\n\nto prevent received signals from entering the transmit path and further configured to disconnect the first reactive impedance during transmission. \n\n13.  A system for radio control, comprising: \n\na transmit/receive switch control configured to connect a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier, \n\nto connect a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier, \n\nto prevent received signals from entering the transmit path and further configured to disconnect the first reactive impedance during transmission, and \n\nto disconnect the second reactive impedance during reception. \n\n16.  The system of claim 15, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel. \n\n14.  The system of claim 13, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel. \n\n17.  The system of claim 16, wherein the transmit/receive switch control is further configured to connect a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.\n\n15.  The system of claim 14, wherein the transmit/receive switch control is further configured to connect a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.\n\n18.  The system of claim 15, further wherein the transmit/receive switch control is further configured \n\nto connect a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier.\n\n13.  A system for radio control, comprising: \n\n……,\n\nto connect a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier, \n\n……. \n\n\n\n\nClaim Rejections - 35 USC § 103\nThe following is a quotation of 35 U.S.C. 103 which forms the basis for all obviousness rejections set forth in this Office action:\nA patent for a claimed invention may not be obtained, notwithstanding that the claimed invention is not identically disclosed as set forth in section 102 of this title, if the differences between the claimed invention and the prior art are such that the claimed invention as a whole would have been obvious before the effective filing date of the claimed invention to a person having ordinary skill in the art to which the claimed invention pertains.  Patentability shall not be negated by the manner in which the invention was made.\n\n\nClaims 1-10, 12-14 and 15-18 are rejected under 35 U.S.C. 103 as being unpatentable over Monroe (US 2005/0255810 A1) in view of Mei (US 2014/0253246 A1).\nConsider claim 1:\nMonroe discloses a radio front-end (see Fig. 2 and paragraph 0032, where Monroe describes a radio frequency (RF) transceiver 250 that is connected to a transmit-receive (T/R) switch 255), comprising:\na transmit path comprising a power amplifier (see Fig. 3 and paragraph 0035, where Monroe describes that the transmit path of the RF transceiver 250 comprises a power amplifier 302);\na receive path comprising a low-noise amplifier (see Fig. 3 and paragraph 0035, where Monroe describes that the receive path of the RF transceiver 250 comprises a low-noise amplifier 303); and\na transmit/receive switch configured to connect the transmit path and the receive path to an antenna (see Fig. 3 and paragraph 0039, where Monroe describes the T/R switch 255 connects the transmit path and the receive path to an antenna 260), \nthe transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier (see Fig. 3 and paragraph 0037, where Monroe describes that a quarter-wave transmission line 330 is connected in parallel with the power amplifier 302), said first switched reactive impedance having an impedance (see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode). \nMonroe discloses that the output of the power amplifier is connected to a quarter-wave transmission line which is an impedance inverter (see Fig. 3 and paragraph 0037) without specifically disclosing that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier. \nMei teaches that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier (see Fig. 1 and paragraph 0006, where Mei describes that the output of a power amplifier 2 is directed to an inverting impedance matching network that is a quarter-wave transmission line, which transforms the output impedance of the power amplifier to a desired impedance, thus neutralization). \nTherefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005).\nConsider claims 8 and 15:\nMonroe discloses a method for radio control (see Fig. 2 and paragraph 0032, where Monroe describes a radio frequency (RF) transceiver 250), comprising:\nconnecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception (see Fig. 3 and paragraph 0037, where Monroe describes that a quarter-wave transmission line 330 is connected in parallel with the power amplifier 302; see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode) to prevent received signals from entering the transmit path (see Fig. 5 and paragraph 0041, where Monroe describes that the received RF signals enter antenna 260 and flow through circulators 310 and 315 as indicated by dotted line 599 to the low noise amplifier 303); and\ndisconnecting the first reactive impedance during transmission (see paragraph 0037, where Monroe describes that the quarter-wave transmission line 330 is an open circuit during transmit mode).\nMonroe discloses that the output of the power amplifier is connected to a quarter-wave transmission line which is an impedance inverter (see Fig. 3 and paragraph 0037) without specifically disclosing that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier. \nMei teaches that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier (see Fig. 1 and paragraph 0006, where Mei describes that the output of a power amplifier 2 is directed to an inverting impedance matching network that is a quarter-wave transmission line, which transforms the output impedance of the power amplifier to a desired impedance, thus neutralization). \nTherefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include that the quarter-wave transmission line is configured to neutralize a reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005).\nConsider claims 2, 9 and 16:\nMonroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a plurality of independently switched impedances arranged in parallel (see Fig. 3 and paragraph Monroe describes an inductor 350 and a pin diode 335 that are arranged in parallel).\nConsider claim 3:\nMonroe in view of Mei discloses the invention of claim 1 above. Monroe discloses the first switched reactive impedance is switched on during a reception stage (see paragraph 0017, where Monroe describes the quarter-wave transmission line appears as a low impedance to a noise signal from a power amplifier during the receive mode) and switched off during a transmission stage (see paragraph 0037, where Monroe describes that the quarter-wave transmission line 330 is an open circuit during transmit mode).\nConsider claim 4:\nMonroe in view of Mei discloses the invention of claim 1 above. Monroe discloses the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch (see Fig. 3 and paragraph 0039, where Monroe describes the transmit path 399 in which the transmit signal enters circulator 310 on the way to antenna 260).\nConsider claims 5, 14 and 18:\nMonroe in view of Mei discloses the invention of claims 1, 8 and 15 above. Monroe discloses a second switched reactive impedance connected in parallel with the low-noise amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive input impedance of the low-noise amplifier (see Fig. 1A and paragraph 0005, where Monroe describes that during receive periods, a quarter-wave transmission line 155 and the pin-diode 160 in parallel with the LNA input impedance present a 50 ohm impedance).\nConsider claim 6:\nMonroe in view of Mei discloses the invention of claim 1 above. Monroe discloses a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna (see Fig. 6 and paragraph 0042, where Monroe describes a quarter-wave transmission line 605 connecting the low-noise amplifier 303 to the antenna 260).\nConsider claim 7:\nMonroe in view of Mei discloses the invention of claim 6 above. Monroe discloses a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission (see Fig. 3 and paragraph 0037, where Monroe describes a pin diode 335 that is connected to ground, which is on and appears as a short circuit during transmit mode).\nConsider claims 10 and 17:\nMonroe in view of Mei discloses the invention of claims 9 and 16 above. Monroe does not specifically disclose connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier. \nMei teaches connecting a set of independently switched impedances selected to most closely match the reactive impedance of the power amplifier (see Fig. 1 and paragraphs 0005-0006, where Mei describes that the inverting impedance matching network matches the output impedance of the power amplifier Z1 to an impedance Z2). \nTherefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier, as taught by Mei to modify the method of Monroe in order to improve efficiency, as discussed by Mei (see paragraphs 0004-0005).\nConsider claim 12:\nMonroe in view of Mei discloses the invention of claim 8 above. Monroe discloses setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line (see Fig. 7 and paragraph 0044, where Monroe describes that a pin diode 705 is on during transmit mode).\nConsider claim 13:\nMonroe in view of Mei discloses the invention of claim 12 above. Monroe discloses setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low- noise amplifier and the one-quarter wavelength transmission line (see Fig. 5 and paragraph 0041, where Monroe describes the receive mode).\n\nClaim 11 is rejected under 35 U.S.C. 103 as being unpatentable over Monroe (US 2005/0255810 A1) in view of Mei (US 2014/0253246 A1), as applied to claim 10 above, and further in view of Gorbachov (US 2012/0280754 A1).\nConsider claim 11:\nMonroe in view of Mei discloses the invention of claim 10 above. Monroe does not specifically disclose measuring the reactive impedance of the power amplifier.\nBank teaches measuring the reactive impedance of the power amplifier (see claim 7, where Gorbachov describes the reactive impedance of a power amplifier is approximately 0 Ohms).\nTherefore, it would have been obvious to one ordinary skill in the art before the effective filing date of the claimed invention to include measuring the reactive impedance of the power amplifier, as taught by Gorbachov to modify the method of Monroe in order to improve primary performance parameters, as discussed by Gorbachov (see paragraph 0070).\n\nConclusion\n",
    "NOABodyText": "CNTA  15/173,034  NOA  84468  2631      DETAILED ACTION   Continued Examination Under 37 CFR 1.114  07-42-04 AIA A request for continued examination under 37 CFR 1.114, including the fee set forth in 37 CFR 1.17(e), was filed in this application after final rejection.  Since this application is eligible for continued examination under 37 CFR 1.114, and the fee set forth in 37 CFR 1.17(e) has been timely paid, the finality of the previous Office action has been withdrawn pursuant to 37 CFR 1.114.  Applicant's submission filed on 10/20/2017 has been entered.    Allowable Subject Matter  12-151-07 AIA 07-97 12-51-07 Claim s 1-18 are allowed.  13-03 AIA The following is an examiner’s statement of reasons for allowance:  The independent claims (claims 1, 8 and 15) of the instant application have been amended to recite an invention of configuring a first reactive impedance in parallel with a power amplifier on a transmit path. The first reactive impedance has an impedance that is opposite to a reactive impedance of the power amplifier.  The prior art of record fails to anticipate or render obvious to one of ordinary skill in the art all the claim elements of the claims 1, 8 and 15. Specifically, the examiner’s best prior art by Monroe (US 2005/0255810 A1) does not teach “The first reactive impedance has an impedance that is opposite to a reactive impedance of the power amplifier” as recited in claims 1, 8 and 15.  Therefore, claims 1, 8 and 15 are considered distinct from prior art and are allowable. Since claims 2-7 are depending on claim 1, claims 9-14 are depending on claim 8, and claims 16-18 are depending on claim 15, the dependent claims become allowable accordingly .  Any comments considered necessary by applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled “Comments on Statement of Reasons for Allowance.”   Conclusion  Any inquiry concerning this communication or earlier communications from the examiner should be directed to LIHONG YU whose telephone number is (571)270-5147.  The examiner can normally be reached on 8:30 am-7:00 pm Monday-Friday.  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisor, Shuwang Liu can be reached on (571) 272-3036.  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see http://pair-direct.uspto.gov. Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free). If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.       /LIHONG YU/  Primary Examiner, Art Unit 2631      Application/Control Number:  15/173,034  Page 2    Art Unit:  2631",
    "applicationNumber": "15173034",
    "patentsCitedByExaminer": [
        {
            "referenceIdentifier": "20050255810",
            "abstract": "A transmit-receive (T/R) switch for coupling a TDD transceiver to an antenna. The T/R switch comprises 1) a first circulator having a first port for receiving a transmit signal from the transceiver during transmit mode, a second port for sending the transmit signal to the antenna during transmit mode and receiving a received signal from the antenna during receive mode, and a third port for sending the received signal towards the transceiver during receive mode. The T/R switch further comprises 2) a second circulator having a first port for receiving the received signal from the third port of the first circulator during receive mode and a second port for sending the received signal towards the transceiver during receive mode, and 3) a termination load coupled to a third port of the second circulator. The circulators divert RF energy reflected from the antenna during transmit mode into the termination load.",
            "claims": [
                "1. A transmit-receive switch for coupling a radio frequency (RF) transceiver capable of time-division duplex operation to an antenna, said transmit-receive switch comprising:\na first circulator having a first port for receiving a transmit signal from a transmit path of said RF transceiver during transmit mode, a second port for sending said transmit signal to said antenna during transmit mode and receiving a received signal from said antenna during receive mode, and a third port for sending said received signal towards a receive path of said RF transceiver during receive mode; and\na second circulator having a first port for receiving said received signal from said third port of said first circulator during receive mode and a second port for sending said received signal towards said RF transceiver during receive mode.",
                "2. The transmit-receive switch as set forth in claim 1, further comprising a termination load coupled to a third port of said second circulator.",
                "3. The transmit-receive switch as set forth in claim 2, wherein said RF energy reflected from said antenna during transmit mode is received in said second port of said first circulator and is sent from said third port of said first circulator to said first port of said second circulator.",
                "4. The transmit-receive switch as set forth in claim 3, wherein said reflected RF energy received from said first circulator in said first port of said second circulator during transmit mode is sent from said second port of said second circulator towards said receive path of said RF transceiver.",
                "5. The transmit-receive switch as set forth in claim 4, wherein RF energy reflected back from said RF transceiver during transmit mode is received in said second port of said second circulator and is sent from said third port of said second circulator towards said termination load.",
                "6. The transmit-receive switch as set forth in claim 5, further comprising a quarter-wave transmission line and a pin-diode connected in series between said first input of said first circulator and ground, wherein said quarter-wave transmission line appears as a high impedance to said transmit signal during transmit mode and appears as a low impedance to a noise signal from a power amplifier in said RF transceiver during said receive mode.",
                "7. The transmit-receive switch as set forth in claim 5, further comprising a tunable filter coupled between said second port of said second circulator and said receive path of said RF transceiver, wherein said tunable filter allows said received signal to pass to said receive path of said RF transceiver during receive mode and reflects said reflected RF signal back to said second circulator during transmit mode.",
                "8. The transmit-receive switch as set forth in claim 5, further comprising a tunable filter and a quarter-wave transmission line coupled in series between said second port of said second circulator and said receive path of said RF transceiver, wherein said quarter-wave transmission line appears as a high impedance during transmit mode and reflects said reflected RF signal back to said second circulator during transmit mode.",
                "9. For use in a wireless network, a base station capable of communicating with a plurality of mobile stations comprising:\na radio frequency (RF) transceiver capable of time-division duplex operation; and\na transmit-receive switch for coupling said RF transceiver to an antenna, said transmit-receive switch comprising:\na first circulator having a first port for receiving a transmit signal from a transmit path of said RF transceiver during transmit mode, a second port for sending said transmit signal to said antenna during transmit mode and receiving a received signal from said antenna during receive mode, and a third port for sending said received signal towards a receive path of said RF transceiver during receive mode; and\na second circulator having a first port for receiving said received signal from said third port of said first circulator during receive mode and a second port for sending said received signal towards said RF transceiver during receive mode.",
                "10. The base station as set forth in claim 9, wherein said transmit-receive switch further comprises a termination load coupled to a third port of said second circulator.",
                "11. The base station as set forth in claim 10, wherein said RF energy reflected from said antenna during transmit mode is received in said second port of said first circulator and is sent from said third port of said first circulator to said first port of said second circulator.",
                "12. The base station as set forth in claim 11, wherein said reflected RF energy received from said first circulator in said first port of said second circulator during transmit mode is sent from said second port of said second circulator towards said receive path of said RF transceiver.",
                "13. The base station as set forth in claim 12, wherein RF energy reflected back from said RF transceiver during transmit mode is received in said second port of said second circulator and is sent from said third port of said second circulator towards said termination load.",
                "14. The base station as set forth in claim 13, wherein said transmit-receive switch further comprises a quarter-wave transmission line and a pin-diode connected in series between said first input of said first circulator and ground, wherein said quarter-wave transmission line appears as a high impedance to said transmit signal during transmit mode and appears as a low impedance to a noise signal from a power amplifier in said RF transceiver during said receive mode.",
                "15. The base station as set forth in claim 13, wherein said transmit-receive switch further comprises a tunable filter coupled between said second port of said second circulator and said receive path of said RF transceiver, wherein said tunable filter allows said received signal to pass to said receive path of said RF transceiver during receive mode and reflects said reflected RF signal back to said second circulator during transmit mode.",
                "16. The base station as set forth in claim 13, wherein said transmit-receive switch further comprises a tunable filter and a quarter-wave transmission line coupled in series between said second port of said second circulator and said receive path of said RF transceiver, wherein said quarter-wave transmission line appears as a high impedance during transmit mode and reflects said reflected RF signal back to said second circulator during transmit mode.",
                "17. A wireless network comprising a plurality of base stations capable of communicating with said plurality of mobile stations in a coverage area of said wireless network, each of said plurality of base stations comprising:\na radio frequency (RF) transceiver capable of time-division duplex operation; and\na transmit-receive switch for coupling said RF transceiver to an antenna, said transmit-receive switch comprising:\na first circulator having a first port for receiving a transmit signal from a transmit path of said RF transceiver during transmit mode, a second port for sending said transmit signal to said antenna during transmit mode and receiving a received signal from said antenna during receive mode, and a third port for sending said received signal towards a receive path of said RF transceiver during receive mode; and\na second circulator having a first port for receiving said received signal from said third port of said first circulator during receive mode and a second port for sending said received signal towards said RF transceiver during receive mode.",
                "18. The wireless network as set forth in claim 17, wherein said transmit-receive switch further comprises a termination load coupled to a third port of said second circulator.",
                "19. The wireless network as set forth in claim 18, wherein said RF energy reflected from said antenna during transmit mode is received in said second port of said first circulator and is sent from said third port of said first circulator to said first port of said second circulator.",
                "20. The wireless network as set forth in claim 19, wherein said reflected RF energy received from said first circulator in said first port of said second circulator during transmit mode is sent from said second port of said second circulator towards said receive path of said RF transceiver."
            ]
        },
        {
            "referenceIdentifier": "9559747",
            "abstract": "Transmit/receive switches and methods for radio control include connecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path. The first reactive impedance is disconnected during transmission.",
            "claims": [
                "1. A radio front-end, comprising:\na transmit path comprising a power amplifier;\na receive path comprising a low-noise amplifier; and\na transmit/receive switch configured to connect the transmit path and the receive path to an antenna, the transmit/receive switch comprising a first switched reactive impedance connected in parallel with the power amplifier on the transmit path and a second switched reactive impedance in parallel with the low-noise amplifier on the receive path, said first switched reactive impedance having an impedance configured to neutralize a reactive impedance of the power amplifier, said second switched reactive impedance having an impedance configured to neutralize a reactive impedance of the low-noise amplifier, the transmit/receive switch being further configured to disconnect the second reactive impedance during reception.",
                "2. The radio front-end of claim 1, wherein the first switched reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
                "3. The radio front-end of claim 1, wherein the first switched reactive impedance is switched on during a reception stage and switched off during a transmission stage.",
                "4. The radio front-end of claim 1, wherein the transmit/receive switch connects the transmit path to the antenna by a minimal-length path having a length determined by a minimum feature pitch.",
                "5. The radio front-end of claim 1, wherein the transmit/receive switch further comprises a one-quarter wavelength transmission line connecting the low-noise amplifier to the antenna.",
                "6. The radio front-end of claim 5, wherein the transmit-receive switch further comprises a switch connected to ground in parallel with the low-noise amplifier that is closed during transmission.",
                "7. A method for radio control, comprising:\nconnecting a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier and to prevent received signals from entering the transmit path;\nconnecting a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier;\ndisconnecting the first reactive impedance during transmission; and\ndisconnecting the second reactive impedance during reception.",
                "8. The method of claim 7, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
                "9. The method of claim 8, wherein connecting the first reactive impedance comprises connecting a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier.",
                "10. The method of claim 9, further comprising measuring the reactive impedance of the power amplifier.",
                "11. The method of claim 7, further comprising setting a receive path to a high impedance during transmission by shorting the receive path to ground at a point between a low-noise amplifier and a one-quarter wavelength transmission line.",
                "12. The method of claim 11, further comprising setting the receive path to a low impedance during reception by disconnecting the ground at the point between the low-noise amplifier and the one-quarter wavelength transmission line.",
                "13. A system for radio control, comprising:\na transmit/receive switch control configured to connect a first reactive impedance in parallel with a power amplifier on a transmit path during reception to neutralize a reactive impedance of the power amplifier, to connect a second reactive impedance in parallel with a low-noise amplifier on a receive path during transmission to neutralize a reactive impedance of the low-noise amplifier, to prevent received signals from entering the transmit path and further configured to disconnect the first reactive impedance during transmission, and to disconnect the second reactive impedance during reception.",
                "14. The system of claim 13, wherein the first reactive impedance comprises a plurality of independently switched impedances arranged in parallel.",
                "15. The system of claim 14, wherein the transmit/receive switch control is further configured to connect a set of the independently switched impedances selected to most closely match the reactive impedance of the power amplifier."
            ]
        },
        {
            "referenceIdentifier": "20120280754",
            "abstract": "A power amplifier architecture and front end circuits utilizing the same that connect a transceiver to an antenna are disclosed. The transceiver is configured for a specific operating frequency. An input matching segment is connected to an input port, and an output matching segment is connected to an output port. An amplifier segment includes at least one transistor with a first terminal connected to the input matching segment, a second terminal connected to the output matching segment, and a third terminal connected to a filter with a range of rejection frequencies. The filter is connected in close proximity to a first inductive interconnection tying a junction connected to the third terminal to a ground. A compensator is also connected to the input matching segment and the output matching segment to minimize instability of the filter.",
            "claims": [
                "1. A power amplifier architecture for an operating frequency for connecting a transceiver to an antenna and including an input port and an output port, comprising:\nan input matching segment connected to the input port;\nan output matching segment connected to the output port;\nat least one filter with a range of rejection frequencies;\nan amplifier segment including at least one transistor having a first terminal connected to the input matching segment, a second terminal connected to the output matching segment, and a third terminal connected to the filter in close proximity to a first inductive interconnection tying a junction connected to the third terminal to a ground; and\na compensator connected to the input matching segment and the output matching segment to minimize instability of the filter.",
                "2. The power amplifier architecture of claim 1, wherein the filter includes a first filter capacitor tied to the junction and a first filter inductor in series with the first filter capacitor and tied to the ground.",
                "3. The power amplifier architecture of claim 2, wherein the first filter inductor is a second inductive interconnection extending in a parallel relationship to the first inductive interconnection, the first and second bond wires being magnetically coupled to each other.",
                "4. The power amplifier architecture of claim 3, wherein a magnetic coupling coefficient between the first inductive interconnection and the second inductive interconnection is approximately 0.4 to 0.5.",
                "5. The power amplifier architecture of claim 2, wherein the first filter capacitor and the first filter inductor have values corresponding to a small resistive impedance and reactive impedance at the operating frequency, and a large resistive impedance and reactive impedance at the range of the rejection frequencies.",
                "6. The power amplifier architecture of claim 5, wherein the resistive impedance at the operating frequency is less than approximately 4 Ohms, and the resistive impedance at the range of rejection frequencies is greater than approximately 15 Ohms.",
                "7. The power amplifier architecture of claim 5, wherein the reactive impedance at the operating frequency is approximately 0 Ohms, and the inductive reactive impedance at the range of rejection frequencies is greater than approximately 20 Ohms.",
                "8. The power amplifier architecture of claim 2, wherein the filter includes a second filter capacitor tied to the junction and a second filter inductor in series with the second filter capacitor and tied to ground.",
                "9. The power amplifier architecture of claim 8, wherein the first filter inductor and the second filter inductor are a second inductive interconnection and a third inductive interconnection, respectively, extending in a parallel relationship to the first inductive interconnection, the first, second, and third inductive interconnections being magnetically coupled to each other.",
                "10. The power amplifier architecture of claim 9, wherein a first magnetic coupling coefficient between the first inductive interconnection and the second inductive interconnection, and a second magnetic coupling coefficient between the first inductive interconnection and the third inductive interconnection, are approximately 0.4 to 0.5, and a third magnetic coupling coefficient between the second inductive interconnection and the third inductive interconnection is approximately 0.2 to 0.3.",
                "11. The power amplifier architecture of claim 2, wherein the filter includes a second filter capacitor tied to the third terminal and a second filter inductor in series with the second filter capacitor and tied to the ground, and a third filter inductor connected between the third terminal and the junction.",
                "12. The power amplifier architecture of claim 11, wherein the first filter inductor and the second filter inductor are a second inductive interconnection and a third inductive interconnection, respectively, extending in a parallel relationship to the first inductive interconnection, the first, second, and third inductive interconnection being magnetically coupled to each other.",
                "13. The power amplifier architecture of claim 1, wherein the amplifier segment includes a plurality of transistors connected in a multi-stage sequence, more than one of the transistors being connected to respective filters.",
                "14. The power amplifier architecture of claim 1, wherein the compensator includes:\na parallel resonant circuit with a first compensator capacitor and a compensator inductor, the parallel resonant circuit being defined by a resonance frequency approximate the operating frequency; and\na second compensator capacitor connected in series with the parallel resonant circuit.",
                "15. The power amplifier architecture of claim 14, wherein the compensator affects rejection characteristics at particular signal frequencies.",
                "16. The power amplifier architecture of claim 1, wherein the first inductive interconnection is a bond wire.",
                "17. The power amplifier architecture of claim 1, wherein the first inductive interconnection is an on-die printed inductor.",
                "18. The power amplifier architecture of claim 1, wherein the transistor is a bipolar type in which the first terminal is a base terminal, the second terminal is a collector terminal, and the third terminal is an emitter terminal.",
                "19. The power amplifier architecture of claim 1, wherein the transistor is a field effect type in which the first terminal is a gate terminal, the second terminal is a source terminal, and the third terminal is a drain terminal.",
                "20. The power amplifier architecture of claim 1, wherein the at least one transistor fabricated on a semiconductor architecture selected from a group consisting of metal oxide semiconductor field effect, bipolar junction, heterojunction bipolar, metal semiconductor field effect, and high electron mobility.",
                "21. A radio frequency (RF) front end architecture for connecting a transceiver to an antenna, comprising:\na transmit input port connectible to an output line of the transceiver;\na receive output port connectible to an input line of the transceiver;\na power amplifier with an operating frequency connected to the transmit input port, the power amplifier including a input matching segment, an output matching segment, and an amplifier segment;\na filter with a range of rejection frequencies connected to an emitter side of the amplifier segment;\na compensator connected to the output matching segment and the input matching segment of the power amplifier to minimize instability effects associated with the emitter side filter;\na low noise amplifier connected to the receive output port; and\na switch having a first port connected to the antenna, a second port connected to the low noise amplifier, and a third port connected to the power amplifier, the low noise amplifier and the second being selectively connectible to the antenna by the switch.",
                "22. The RF front end architecture of claim 21, wherein the filter includes components with values corresponding to a small resistive impedance and reactive impedance at the operating frequency, and a large resistive impedance and reactive impedance at the range of rejection frequencies.",
                "23. The RF front end architecture of claim 22, wherein the resistive impedance at the operating frequency is less than approximately 4 Ohms, and the resistive impedance at the range of rejection frequencies is greater than approximately 15 Ohms.",
                "24. The RF front end architecture of claim 22, wherein the reactive impedance at the operating frequency is approximately 0 Ohms, and the inductive reactive impedance at the range of rejection frequencies is greater than approximately 20 Ohms.",
                "25. The power amplifier architecture of claim 21, wherein the compensator includes a parallel resonant circuit defined by a resonance frequency approximate the operating frequency.",
                "26. The power amplifier architecture of claim 25, wherein the compensator affects rejection characteristics at particular signal frequencies.",
                "27. An RF front end circuit connecting a first transceiver operating in a first frequency band to a first antenna and a second transceiver operating in a second frequency band to a second antenna, the front end circuit comprising:\na first power amplifier connectible to a transmit line from the first transceiver;\na first low noise amplifier connectible to a receive line from the first transceiver;\na second power amplifier connectible to a transmit line from the second transceiver;\na second low noise amplifier connectible to a receive line from the second transceiver; and\na co-existence filter in a transmit chain defined by an interconnection between the transmit line from the second transceiver and the second antenna including the second power amplifier, the co-existence filter rejecting a portion of a transmitted signal of the second frequency band overlapping in frequency with a reception of the first frequency band;\nwherein the first power amplifier and the first low noise amplifier are connectible to the first antenna, the second power amplifier and the second low noise amplifier are selectively connectible to the second antenna, and the co-existence filter fabricated on-die together with the second power amplifier and the second low noise amplifier.",
                "28. The RF front end circuit of claim 27, further comprising:\na duplexer having a first port connected to an output of the first power amplifier, a second port connected to an input of the first low noise amplifier, and a third port connectible to the first antenna, the duplexer connecting the first power amplifier and the first low noise amplifier to the first antenna.",
                "29. The RF front end circuit of claim 27, further comprising:\na switch having a first port connected to an output of the second power amplifier, a second port connected to an input of the second low noise amplifier, and a third port connectible to the second antenna, the switch selectively connecting the second power amplifier and the second low noise amplifier to the second antenna.",
                "30. The RF front end circuit of claim 27, wherein the first frequency band corresponds to a Wideband Code Division Multiple Access (WCDMA) mobile communications modality.",
                "31. The RF front end circuit of claim 30, wherein the first frequency band ranges approximately between 2.11 GHz to 2.17 GHz, the first power amplifier and the first low noise amplifier being tuned therefor.",
                "32. The RF front end circuit of claim 27, wherein the second frequency band corresponds to a Wireless Local Area Network (WLAN) data networking modality.",
                "33. The RF front end circuit of claim 32, wherein the second frequency band ranges approximately between 2.4 GHz to 2.5 GHz, the second power amplifier and the second low noise amplifier being tuned therefor.",
                "34. The RF front end circuit of claim 27, wherein the first power amplifier, the second power amplifier, the first low noise amplifier, the second low noise amplifier, and the co-existence filter are fabricated on a semiconductor architecture selected from a group consisting of metal oxide semiconductor field effect, bipolar junction, heterojunction bipolar, metal semiconductor field effect, and high electron mobility."
            ]
        },
        {
            "referenceIdentifier": "20140253246",
            "abstract": "The present invention is directed to an amplifier system that includes a main amplifier configured to amplify and a peak amplifier that operates only in a high power mode. An impedance matching network is coupled to at least the peak power amplifier. An impedance transformation device is coupled to at least a portion of the impedance matching network. The impedance transformation device is configured as a balun in the high power mode. The balun includes a first input and second input coupled to the main amplifier and the peak amplifier respectively. The impedance transformation device is configured as an unbalanced line impedance transformer in the low power mode because the predetermined output impedance substantially grounds the second input. The Doherty device is characterized by an impedance transformation ratio of at least 4:1 and a relative bandwidth greater than or equal to 40%.",
            "claims": [
                "1. An amplifier system comprising:\na main amplifier configured to amplify an in-phase signal during a low power mode and a high power mode, and a peak amplifier configured to amplify a quadrature signal in the high power mode and present a predetermined output impedance is the low power mode;\nan impedance matching network coupled to at least the peak power amplifier; and\nan impedance transformation device coupled to at least a portion of the impedance matching network, the impedance transformation device being configured as a balun in the high power mode, the balun including a first input and second input coupled to the main amplifier and the peak amplifier respectively, the impedance transformation device being configured as an unbalanced line impedance transformer in the low power mode whereby the predetermined output impedance substantially grounds the second input, the Doherty device being characterized by an impedance transformation ratio of at least 4:\n1 and a relative bandwidth greater than or equal to 40%.",
                "2. The system of claim 1, wherein the impedance transformation device includes a first coupler having a first transmission line and a second transmission line, and at least one second coupler having at least one third transmission line and at least one fourth transmission line, the first transmission line and the at least one third transmission line being coupled in parallel to the main amplifier, and the second transmission line and the at least one fourth transmission line being coupled in parallel to the peak amplifier in peak power mode and substantially grounded in low power mode in response to the predetermined output impedance.",
                "3. The system of claim 2, wherein the first coupler and the at least one second coupler are implemented using a pair of tightly coupled transmission lines.",
                "4. The system of claim 2, wherein the even mode impedance is proportional to the system impedance times at least one multiple of (ten.",
                "5. The system of claim 4, wherein the even mode impedance is substantially equal to the system impedance times 50 (fifty).",
                "6. The system of claim 2, wherein the odd mode impedance is less than or equal to the impedance transformation ratio.",
                "7. The system of claim 2, wherein the at least one second coupler includes a second coupler and a third coupler.",
                "8. The system of claim 7, wherein the second coupler includes a third transmission line and a fourth transmission line, and the third coupler includes a fifth transmission line and a sixth transmission line, the first transmission line, the third transmission line and the fifth transmission line being coupled in parallel to the main amplifier.",
                "9. The system of claim 8, wherein the second transmission line, the fourth transmission line and the sixth transmission line are coupled in parallel to the peak amplifier in peak power mode and substantially grounded in low power mode in response to the predetermined output impedance.",
                "10. The system of claim 8, further comprising a second unbalanced line impedance transformer coupled in series with the impedance transformation device.",
                "11. The system of claim 10, wherein the second unbalanced line impedance transformer includes a second-first coupler coupled in series with the first transmission line, the third transmission line and the fifth transmission line, and a second-second coupler disposed in parallel with the second first coupler.",
                "12. The system of claim 11, wherein the impedance transformation ratio is at least 32:\n1.",
                "13. The system of claim 2, further comprising a second unbalanced line impedance transformer coupled in series with the impedance transformation device.",
                "14. The system of claim 13, wherein the second unbalanced line impedance transformer includes a second-first coupler coupled in series with the first transmission line and a second-second coupler disposed in parallel with the second first coupler.",
                "15. The system of claim 13, wherein the impedance transformation ratio is at least 32:\n1.",
                "16. The system of claim 2, wherein the first coupler and the at least one second coupler are implemented using a pair of coaxial cables.",
                "17. The system of claim 1, wherein the impedance matching network coupled to the peak power amplifier is a quarter wave transmission line.",
                "18. The system of claim 17, wherein the main amplifier is coupled directly to the first input.",
                "19. The system of claim 18, wherein the impedance transformation ratio is unity.",
                "20. The system of claim 18, wherein the impedance transformation ratio is at least 4:\n1.",
                "21. The system of claim 18, wherein the relative bandwidth is at least 50%.",
                "22. The system of claim 17, wherein the second coupler includes a third transmission line and a fourth transmission line, and the third coupler includes a fifth transmission line and a sixth transmission line, the first transmission line, the third transmission line and the fifth transmission line being coupled in parallel to the main amplifier.",
                "23. The system of claim 22, wherein the second transmission line, the fourth transmission line and the sixth transmission line are coupled in parallel to the peak amplifier in peak power mode and substantially grounded in low power mode in response to the predetermined output impedance."
            ]
        }
    ],
    "firstInventorToFileIndicator": "Y",
    "applicationStatusCode": 150,
    "applicationTypeCode": "UTL",
    "entityStatusData": {
        "smallEntityStatusIndicator": false,
        "businessEntityStatusCategory": "Regular Undiscounted"
    },
    "filingDate": "2016-06-03",
    "class/subclass": "375/219",
    "nationalStageIndicator": false,
    "firstInventorName": "Alberto Valdes Garcia",
    "cpcClassificationBag": [
        "H03F3/24",
        "H04B17/102",
        "H04L25/0278",
        "H04B1/48",
        "H04B1/0475",
        "H04B2001/0408"
    ],
    "effectiveFilingDate": "2016-06-03",
    "publicationDateBag": [
        "2017-04-13"
    ],
    "publicationSequenceNumberBag": [
        "0104548"
    ],
    "earliestPublicationDate": "2017-04-13",
    "applicationTypeLabelName": "Utility",
    "applicationStatusDate": "2018-02-21",
    "class": "375",
    "applicationTypeCategory": "REGULAR",
    "applicationStatusDescriptionText": "Patented Case",
    "patentNumber": "9917659",
    "grantDate": "2018-03-13",
    "applicantBag": [
        {
            "applicantNameText": "INTERNATIONAL BUSINESS MACHINES CORPORATION",
            "correspondenceAddressBag": [
                {
                    "cityName": "Armonk",
                    "geographicRegionName": "NEW YORK",
                    "geographicRegionCode": "NY",
                    "nameLineOneText": "INTERNATIONAL BUSINESS MACHINES CORPORATION",
                    "postalAddressCategory": "postal"
                }
            ]
        }
    ],
    "firstApplicantName": "INTERNATIONAL BUSINESS MACHINES CORPORATION",
    "customerNumber": 877,
    "groupArtUnitNumber": "2631",
    "earliestPublicationNumber": "US20170104548A1",
    "inventionTitle": "EFFICIENT TRANSMIT AND RECEIVE SWITCHES",
    "applicationConfirmationNumber": 7625,
    "examinerNameText": "YU, LIHONG",
    "subclass": "219",
    "publicationCategoryBag": [
        "Granted/Issued",
        "Pre-Grant Publications - PGPub"
    ],
    "docketNumber": "YOR920150782US2 (1085CON)"
}