{
    "id": 7602,
    "abstract": "ABSTRACT A foldable display device is provided, which can effectively release stress in a bending state by a combination of a surface frame bending device, a surface frame slide device, and a surface frame elastic device, thereby ensuring that the display panel can be smoothly bent without wrinkles and breakage damage. 21",
    "initialClaims": [
        "1. A foldable display device, comprising: an outer case comprising at least a housing; a middle frame mounted to the outer case, wherein the middle frame comprises at least two frame plates and a middle frame bending apparatus located between the frame plates; a display panel mounted to the middle frame, wherein the display panel comprises a panel bending region opposite to the middle frame bending apparatus; and a surface frame apparatus mounted to the outer case and comprising: at least a surface frame, wherein an opening is disposed in the surface frame, and the display panel is engaged into the opening; a surface frame bending apparatus opposite to the middle frame bending apparatus; wherein when the display panel is in a bending state, the middle frame bending apparatus and the surface frame bending apparatus form a first cavity, and the panel bending region is bent into the first cavity; and wherein when the display panel is in a non-bending state, the surface frame bending apparatus causes the panel bending region to be in a flattened state by supporting the middle frame bending apparatus.",
        "2. The foldable display device according to Claim 1, wherein the display panel is a flexible display panel.",
        "3. The foldable display device according to Claim 1, wherein the outer case is in a split type.",
        "4. The foldable display device according to Claim 1, wherein the display panel comprises: a first region located at one side of the panel bending region and a second region located at another side of the panel bending region, and wherein when the display panel is in the bending state, the first region is opposite to the second region.",
        "5. The foldable display device according to Claim 4, wherein the outer case comprises: a first housing opposite to the first region; and a second housing opposite to the second region, wherein the first housing and the second housing are connected with the surface frame by screw bolts.",
        "6. The foldable display device according to Claim 5, further comprising fifth through holes formed in the outer case, wherein the first housing and the second housing are connected with the surface frame by the screw bolts passing through the fifth through holes.",
        "7. The foldable display device according to Claim 6, further comprising at least four of the fifth through holes formed in the outer case.",
        "8. The foldable display device according to Claim 6, further comprising sixth through holes aligned with the fifth through holes in a one-to-one manner, wherein the outer case is rigidly connected to the surface shell by the screw bolts passing through the fifth through holes and the sixth through holes.",
        "9. The foldable display device according to Claim 8, wherein hole size of one of the fifth through holes is equal to hole size of the aligned one of the sixth through holes, and center of one of the fifth through holes is in a same straight line as center of the aligned one of the sixth through holes.",
        "10. The foldable display device according to Claim 5, wherein shape and size of the first housing is the same with shape and size of the second housing.",
        "11. The foldable display device according to Claim 1, wherein the outer case comprises a first housing opposite to the first region and a second housing opposite to the second region; wherein the first housing comprises two first housing sidewalls disposed in parallel and a first housing connecting wall vertically connected with the two first sidewalls; wherein the second housing comprises two second housing sidewalls disposed in parallel and a second housing connecting wall vertically connected with the two second sidewalls; and wherein the two first housing sidewalls together with the first housing connecting wall form a first housing open cavity, the two second housing sidewalls together with the second housing connecting wall form a second housing open cavity, and the display panel displays a picture through the first housing open cavity and the second housing open cavity.",
        "12. The foldable display device according to Claim 1, wherein the surface frame apparatus comprises a first surface frame and a second surface frame; wherein the surface frame bending apparatus comprises at least a first gear tooth disposed on the first surface frame and at least a second gear tooth disposed on the second surface frame; wherein the first gear tooth on the first surface frame is engaged with the second gear tooth on the second surface frame; and wherein the first gear tooth further comprises a first support plane, and the second gear further comprises a second support plane, wherein the first support plane and the second support plane are configured to support the middle frame bending apparatus.",
        "13. The foldable display device according to Claim 12, wherein the first surface frame comprises two first surface frame sidewalls in parallel and a first surface frame connecting sidewall vertically connected with the two first surface frame sidewalls; and wherein the second surface frame comprises two second surface frame sidewalls in parallel and a second surface frame connecting sidewall vertically connected with the two first surface frame sidewalls.",
        "14. The foldable display device according to Claim 13, wherein the first gear tooth and the second gear tooth are semicircular.",
        "15. The foldable display device according to Claim 14, wherein the first gear tooth is located at an edge of the first surface frame sidewall, and the second gear tooth is located at an edge of the second surface frame sidewall.",
        "16. The foldable display device according to Claim 12, wherein the surface frame bending apparatus further comprises: at least a connecting plate; at least two hinge plates oppositely disposed, protruding, and vertical to a surface at a side of the connecting plate, wherein the two hinge plates are disposed at two ends of the connecting plate, respectively; and each of the two hinge plates is disposed with a first through hole and a second through hole, wherein the first through hole is aligned with the first gear tooth, and the second through hole is aligned with the second gear tooth.",
        "17. The foldable display device according to Claim 16, wherein the first gear tooth is further disposed with a third through hole aligned with the first through hole, and the second gear tooth is further disposed with a fourth through hole aligned with the second through hole; wherein hole size of the first through hole is equal to hole size of the third through hole, and center of the first through hole is in a same straight line as center of the third through hole; and wherein hole size of the second through hole is equal to hole size of the fourth through hole, and center of the second through hole is in a same straight line as center of the fourth through hole.",
        "18. The foldable display device according to Claim 1, wherein the middle frame further comprises a first frame plate and a second frame plate disposed at two sides of the middle frame bending apparatus; wherein each of the first frame plate and the second frame plate is aligned with the housing, and each of the first frame plate and the second frame plate together with the housing form a gap; wherein the middle frame bending apparatus comprises a first movable plate and a second movable plate, wherein the first movable plate is rotatably mounted on the first surface frame, and the second movable plate is rotatably mounted on the second surface frame; wherein when the display panel is in a non-bending state, upper surfaces of the frame plate, the first movable plate, and the second movable plate are located in a same plane; and wherein when the display panel is in a bending state, the first movable plate and the second movable plate are moved into the first cavity.",
        "19. The foldable display device according to Claim 1, wherein the surface frame apparatus further comprises at least a surface frame slide apparatus; and wherein the surface frame slide apparatus comprises: a first component disposed with a first protrusion; a second component disposed with a first groove; wherein when the display panel is in a non-bending state, the first protrusion is adjacent to the first groove and is docked with the first groove; and wherein when the display panel is in a bending state, the first protrusion is away from the first groove.",
        "20. The foldable display device according to Claim 1, wherein the surface frame apparatus further comprises at least a surface frame elastic apparatus; and wherein the surface frame slide apparatus comprises: a third component comprising a second protrusion; a fourth component comprising a second groove; an elastic component disposed in the second groove; a mounting plate rigidly connected with the fourth component; wherein when the display panel is in a non-bending state, the second protrusion is adjacent to the second groove and presses the elastic component to dock with the second groove; and wherein when the display panel is in a bending state, the second protrusion is away from the second groove."
    ],
    "finalClaims": [
        "1. (Cancelled)",
        "2. The foldable display device according to Claim 1, wherein the display panel is a flexible display panel.",
        "3. The foldable display device according to Claim 1, wherein the outer case is in a split type.",
        "4. The foldable display device according to Claim 1, wherein the display panel comprises: a first region located at one side of the panel bending region and a second region located at another side of the panel bending region, and wherein when the display panel is in the bending state, the first region is opposite to the second region.",
        "5. The foldable display device according to Claim 4, wherein the outer case comprises: a first housing opposite to the first region; and a second housing opposite to the second region, wherein the first housing and the second housing are connected with the surface frame by screw bolts.",
        "6. The foldable display device according to Claim 5, further comprising fifth through holes formed in the outer case, wherein the first housing and the second housing are connected with the surface frame by the screw bolts passing through the fifth through holes.",
        "7. The foldable display device according to Claim 6, further comprising at least four of the fifth through holes formed in the outer case.",
        "8. The foldable display device according to Claim 6, further comprising sixth through holes aligned with the fifth through holes in a one-to-one manner, wherein the outer case is rigidly connected to the surface shell by the screw bolts passing through the fifth through holes and the sixth through holes.",
        "9. The foldable display device according to Claim 8, wherein hole size of one of the fifth through holes is equal to hole size of the aligned one of the sixth through holes, and center of one of the fifth through holes is in a same straight line as center of the aligned one of the sixth through holes.",
        "10. The foldable display device according to Claim 5, wherein shape and size of the first housing is the same with shape and size of the second housing.",
        "11. The foldable display device according to Claim 4, wherein the outer case comprises a first housing opposite to the first region and a second housing opposite to the second region; wherein the first housing comprises two first housing sidewalls disposed in parallel and a first housing connecting wall vertically connected with the two first sidewalls; wherein the second housing comprises two second housing sidewalls disposed in parallel and a second housing connecting wall vertically connected with the two second sidewalls; and wherein the two first housing sidewalls together with the first housing connecting wall form a first housing open cavity, the two second housing sidewalls together with the second housing connecting wall form a second housing open cavity, and the display panel displays a picture through the first housing open cavity and the second housing open cavity.",
        "12. (Cancelled)",
        "13. The foldable display device according to Claim 1 , wherein the first surface frame comprises two first surface frame sidewalls in parallel and a first surface frame connecting sidewall vertically connected with the two first surface frame sidewalls; and wherein the second surface frame comprises two second surface frame sidewalls in parallel and a second surface frame connecting sidewall vertically connected with the two first surface frame sidewalls.",
        "14. The foldable display device according to Claim 13, wherein the first gear tooth and the second gear tooth are semicircular.",
        "15. The foldable display device according to Claim 14, wherein the first gear tooth is located at an edge of the first surface frame sidewall, and the second gear tooth is located at an edge of the second surface frame sidewall.",
        "16. The foldable display device according to Claim 1 , wherein the surface frame bending apparatus further comprises: at least a connecting plate; at least two hinge plates oppositely disposed, protruding, and vertical to a surface at a side of the connecting plate, wherein the two hinge plates are disposed at two ends of the connecting plate, respectively; and each of the two hinge plates is disposed with a first through hole and a second through hole, wherein the first through hole is aligned with the first gear tooth, and the second through hole is aligned with the second gear tooth.",
        "17. The foldable display device according to Claim 16, wherein the first gear tooth is further disposed with a third through hole aligned with the first through hole, and the second gear tooth is further disposed with a fourth through hole aligned with the second through hole; wherein hole size of the first through hole is equal to hole size of the third through hole, and center of the first through hole is in a same straight line as center of the third through hole; and wherein hole size of the second through hole is equal to hole size of the fourth through hole, and center of the second through hole is in a same straight line as center of the fourth through hole.",
        "18. The foldable display device according to Claim 1, wherein the middle frame further comprises a first frame plate and a second frame plate disposed at two sides of the middle frame bending apparatus; wherein each of the first frame plate and the second frame plate is aligned with the housing, and each of the first frame plate and the second frame plate together with the housing form a gap; wherein the middle frame bending apparatus comprises a first movable plate and a second movable plate, wherein the first movable plate is rotatably mounted on the first surface frame, and the second movable plate is rotatably mounted on the second surface frame; wherein when the display panel is in a non-bending state, upper surfaces of the frame platesplate, the first movable plate, and the second movable plate are located in a same plane; and wherein when the display panel is in a bending state, the first movable plate and the second movable plate are moved into the first cavity.",
        "19. The foldable display device according to Claim 1, wherein the surface frame apparatus further comprises at least a surface frame slide apparatus; and wherein the surface frame slide apparatus comprises: a first component disposed with a first protrusion; a second component disposed with a first groove; wherein when the display panel is in a non-bending state, the first protrusion is adjacent to the first groove and is docked with the first groove; and wherein when the display panel is in a bending state, the first protrusion is away from the first groove.",
        "20. The foldable display device according to Claim 1, wherein the surface frame apparatus further comprises at least a surface frame elastic apparatus; and wherein the surface frame slide apparatus comprises: a third component comprising a second protrusion; a fourth component comprising a second groove; an elastic component disposed in the second groove; a mounting plate rigidly connected with the fourth component; wherein when the display panel is in a non-bending state, the second protrusion is adjacent to the second groove and presses the elastic component to dock with the second groove; and wherein when the display panel is in a bending state, the second protrusion is away from the second groove."
    ],
    "CTNFDocumentIdentifier": "KVCI3UI0DFLYX10",
    "CTNFBodyText": "\n\n    DETAILED ACTION\nNotice of Pre-AIA  or AIA  Status\nThe present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA .\n\nPriority\nReceipt is acknowledged of certified copies of papers required by 37 CFR 1.55.\n\nInformation Disclosure Statement\nThe information disclosure statement (IDS) submitted on 11/27/2019 was considered by the examiner.\n\nClaim Rejections - 35 USC § 112\nThe following is a quotation of 35 U.S.C. 112(b):\n(b)  CONCLUSION.—The specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the inventor or a joint inventor regards as the invention.\n\n\nThe following is a quotation of 35 U.S.C. 112 (pre-AIA ), second paragraph:\nThe specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the applicant regards as his invention.\n\n\nClaims 11 and 18 are rejected under 35 U.S.C. 112(b) or 35 U.S.C. 112 (pre-AIA ), second paragraph, as being indefinite for failing to particularly point out and distinctly claim the subject matter which the inventor or a joint inventor (or for applications subject to pre-AIA  35 U.S.C. 112, the applicant), regards as the invention.\nClaim 11 recites the limitation the first region in line 2.  There is insufficient antecedent basis for this limitation in the claim.  Claim 11 recites the limitation the second region in line 3.  There is insufficient antecedent basis for this limitation in the claim.  Claim 18 recites the limitation the frame plate in line 12.  There is insufficient antecedent basis for this limitation in the claim.\n\nClaim Rejections - 35 USC § 102\nIn the event the determination of the status of the application as subject to AIA  35 U.S.C. 102 and 103 (or as subject to pre-AIA  35 U.S.C. 102 and 103) is incorrect, any correction of the statutory basis for the rejection will not be considered a new ground of rejection if the prior art relied upon, and the rationale supporting the rejection, would be the same under either status.  \nThe following is a quotation of the appropriate paragraphs of 35 U.S.C. 102 that form the basis for the rejections under this section made in this Office action:\nA person shall be entitled to a patent unless –\n\n(a)(1) the claimed invention was patented, described in a printed publication, or in public use, on sale, or otherwise available to the public before the effective filing date of the claimed invention.\n\n\nClaim(s) 1-5, 10 and 18 is/are rejected under 35 U.S.C. 102(a)(1) as being anticipated by Park et al. (9600035).  With respect to claim 1, Park et al. discloses a foldable display device, comprising: an outer case (100) comprising at least a housing (100a, 100b); a middle frame (200) mounted to the outer case (100), wherein the middle frame (200) comprises at least two frame plates (201a, 201b) and a middle frame bending apparatus (600a, 600b) located between the frame plates (201a, 201b); a display panel (700) mounted to the middle frame (200), wherein the display panel (700) comprises a panel bending region (A1, A2) opposite to the middle frame bending apparatus; and a surface frame apparatus (800) mounted to the outer case (100) and comprising: at least a surface frame (800a, 800b), wherein an opening is disposed in the surface frame (800a, 800b), and the display panel (700) is engaged into the opening; a surface frame bending apparatus (folding portion of 800a, 800b) opposite to the middle frame bending apparatus (600a, 600b); wherein when the display panel (700) is in a bending state (figure 11), the middle frame bending apparatus (600a, 600b) and the surface frame bending apparatus (folding portion of 800a, 800b) form a first cavity, and the panel bending region (A1, A2) is bent into the first cavity; and wherein when the display panel (700) is in a non-bending state (figure 10), the surface frame bending apparatus (folding portion of 800a, 800b) causes the panel bending region (A1, A2) to be in a flattened state by supporting the middle frame bending apparatus (600a, 600b).  With respect to claim 2, Park et al. discloses the foldable display device according to Claim 1, wherein the display panel (700) is a flexible display panel.  With respect to claim 3, Park et al. discloses the foldable display device according to Claim 1, wherein the outer case (100) is in a split type.  With respect to claim 4, Park et al. discloses the foldable display device according to Claim 1, wherein the display panel (700) comprises: a first region (700a) located at one side of the panel bending region (A1, A2) and a second region (700b) located at another side of the panel bending region (A1, A2), and wherein when the display panel (700) is in the bending state (figure 11), the first region (700a) is opposite to the second region (700b).  With respect to claim 5, Park et al. discloses the foldable display device according to Claim 4, wherein the outer case (100) comprises: a first housing (100a) opposite to the first region (700a); and a second housing (100b) opposite to the second region (700b), wherein the first housing (100a) and the second housing (100b) are connected with the surface frame by screw bolts (see for example column 7 lines 42-52).  With respect to claim 10, Park et al. discloses the foldable display device according to Claim 5, wherein shape and size of the first housing (100a) is the same with shape and size of the second housing (100b).  With respect to claim 18, Park et al. discloses the foldable display device according to Claim 1, wherein the middle frame (200) further comprises a first frame plate (201a) and a second frame plate (201b) disposed at two sides of the middle frame bending apparatus (600a, 600b); wherein each of the first frame plate (201a) and the second frame plate (201b) is aligned with the housing (100), and each of the first frame plate (201a) and the second frame plate (201b) together with the housing (100) form a gap; wherein the middle frame bending apparatus (600a, 600b) comprises a first movable plate (600a) and a second movable plate (600b), wherein the first movable plate (600a) is rotatably mounted on the first surface frame (200a), and the second movable plate (600b) is rotatably mounted on the second surface frame (200b); wherein when the display panel (700) is in a non-bending state (figure 10), upper surfaces of the frame plate [112LAB, (which plate)], the first movable plate (600a), and the second movable plate (600b) are located in a same plane; and wherein when the display panel (700) is in a bending state (figure 11), the first movable plate (600a) and the second movable plate (600b) are moved into the first cavity.\n\nAllowable Subject Matter\nClaims 6-9, 12-17, 19, and 20 are objected to as being dependent upon a rejected base claim, but would be allowable if rewritten in independent form including all of the limitations of the base claim and any intervening claims.\nThe following is a statement of reasons for the indication of allowable subject matter:  as to claims 6-9, patentability resides, at least in part, in the fifth through holes formed in the outer case, wherein the first housing and the second housing are connected with the surface frame by the screw bolts passing through the fifth through holes as claimed and including all of the other limitations of the base claims respectfully; as to claims 12-17, patentability resides, at least in part, in the surface frame apparatus comprises a first surface frame and a second surface frame; wherein the surface frame bending apparatus comprises at least a first gear tooth disposed on the first surface frame and at least a second gear tooth disposed on the second surface frame; wherein the first gear tooth on the first surface frame is engaged with the second gear tooth on the second surface frame; and wherein the first gear tooth further comprises a first support plane, and the second gear further comprises a second support plane, wherein the first support plane and the second support plane are configured to support the middle frame bending apparatus as claimed and including all of the other limitations of the base claims respectfully; as to claim 19, patentability resides, at least in part, in the surface frame apparatus further comprises at least a surface frame slide apparatus; and wherein the surface frame slide apparatus comprises: a first component disposed with a first protrusion;  a second component disposed with a first groove; wherein when the display panel is in a non-bending state, the first protrusion is adjacent to the first groove and is docked with the first groove; and wherein when the display panel is in a bending state, the first protrusion is away from the first groove as claimed and including all of the other limitations of the base claims respectfully; as to claim 20, patentability resides, at least in part, in the surface frame apparatus further comprises at least a surface frame elastic apparatus; and wherein the surface frame slide apparatus comprises: a third component comprising a second protrusion; a fourth component comprising a second groove; an elastic component disposed in the second groove; a mounting plate rigidly connected with the fourth component; wherein when the display panel is in a non-bending state, the second protrusion is adjacent to the second groove and presses the elastic component to dock with the second groove; and wherein when the display panel is in a bending state, the second protrusion is away from the second groove as claimed and including all of the other limitations of the base claims respectfully.\n\nConclusion\nThe prior art made of record and not relied upon is considered pertinent to applicant's disclosure.\n",
    "NOABodyText": "CNTA  16/469,158  NOA  75503     DETAILED ACTION  Notice of Pre-AIA or AIA Status  15-10-aia AIA 07-03-aia The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA.   Priority  02-26 AIA Receipt is acknowledged of certified copies of papers required by 37 CFR 1.55.   Allowable Subject Matter  12-151-07 AIA 07-97 12-51-07 Claim s 1-11 and 13-20 are allowed.  13-03 AIA The following is an examiner’s statement of reasons for allowance: as to claims 1-11 and 13-20 , see applicant’s remarks beginning on page 7 of the response dated 01/16/2022 .  Any comments considered necessary by applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled “Comments on Statement of Reasons for Allowance.”   Conclusion  Any inquiry concerning this communication or earlier communications from the examiner should be directed to LISA LEA-EDMONDS whose telephone number is (571)272-2043. The examiner can normally be reached M-F.  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisor, Timothy Thompson can be reached on 571-272-2342. The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of published or unpublished applications may be obtained from Patent Center. Unpublished application information in Patent Center is available to registered users. To file and manage patent submissions in Patent Center, visit: https://patentcenter.uspto.gov. Visit https://www.uspto.gov/patents/apply/patent-center for more information about Patent Center and https://www.uspto.gov/patents/docx for information about filing in DOCX format. For additional questions, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free). If you would like assistance from a USPTO Customer Service Representative, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.   LISA LEA-EDMONDS  Primary Examiner  Art Unit 2847     /LISA LEA-EDMONDS/Primary Examiner, Art Unit 2847  2022-01-26     Application/Control Number:  16/469,158\tPage 2    Art Unit:  2847      Application/Control Number:  16/469,158\tPage 3    Art Unit:  2847",
    "applicationNumber": "16469158",
    "patentsCitedByExaminer": [
        {
            "referenceIdentifier": "9600035",
            "abstract": "A display device includes a bottom chassis including first and second bottom portions, a mold frame including first and second frame portions disposed in respective first and second bottom portions, a hinge portion configured to couple the first and second frame portions to each other, a flexible display panel disposed on the mold frame and the hinge portion, a first curvature adjusting portion disposed between one side of the hinge portion and the display panel and coupled to the first frame portion, a second curvature adjusting portion disposed between the opposite side of the hinge portion and the display panel and coupled to the second frame portion, a first support portion coupled to the hinge portion and configured to support the first curvature adjusting portion, and a second support portion coupled to the hinge portion and configured to support the second curvature adjusting portion.",
            "claims": [
                "1. A display device comprising:\na bottom chassis comprising a first bottom portion and a second bottom portion;\na mold frame comprising a first frame portion and a second frame portion respectively disposed in the first and second bottom portions of the bottom chassis;\na hinge portion configured to couple the first and second frame portions of the mold frame to each other;\na flexible display panel disposed on the mold frame and the hinge portion;\na first curvature adjusting portion disposed between one side of the hinge portion and the flexible display panel, the first curvature adjusting portion coupled to the first frame portion;\na second curvature adjusting portion disposed between the opposite side of the hinge portion and the display panel, the second curvature adjusting portion coupled to the second frame portion;\na first support portion coupled to the hinge portion, the first support portion configured to support the first curvature adjusting portion; and\na second support portion coupled to the hinge portion, the second support portion configured to support the second curvature adjusting portion.",
                "2. The display device of claim 1, wherein each of the first and second curvature adjusting portions comprises:\na plurality of adjustment units; and\na plurality of connecting shafts configured to hinge couple the plurality of adjustment units to each other.",
                "3. The display device of claim 2, wherein at least two of the plurality of adjustment units have different angular rotation ranges.",
                "4. The display device of claim 3, wherein an adjustment unit of the plurality of adjustment units that is substantially closer to the hinge portion has a larger angular rotation range.",
                "5. The display device of claim 2, wherein at least one of the plurality of adjustment units have a upper surface and a lower surface having different lengths from each other.",
                "6. The display device of claim 2, wherein an adjustment unit of the plurality of adjustment units disposed furthest from the hinge portion comprises a surface that comprises a projection and groove comprising a hole through which the connecting shaft is inserted.",
                "7. The display device of claim 2, wherein each adjustment unit of the plurality of adjustment units other than an adjustment unit of the plurality of adjustment units disposed furthest from the hinge portion comprise:\na surface comprising at least one first projection and at least one first groove having a first hole, alternately disposed, the connecting shaft is inserted through the first hole of the first groove; and\nan opposite surface comprising at least one second projection and at least one second groove having a second hole, alternately disposed, the connecting shaft is inserted through the second hole of the second groove.",
                "8. The display device of claim 7, wherein the second groove is disposed corresponding to the first projection and the second projection is disposed corresponding to the first groove.",
                "9. The display device of claim 7, wherein the first and second grooves disposed closer from the hinge portion is smaller than the first and second grooves disposed further from the hinge portion.",
                "10. The display device of claim 2, wherein each of the plurality of adjustment units comprises:\na reference adjustment unit;\nat least one curved adjustment unit between any one of the first and second frame portions and an end portion of the reference adjustment unit; and\nat least one straight adjustment unit hinge coupled to the opposite end portion of the reference adjustment unit.",
                "11. The display device of claim 10, wherein the curved adjustment unit is configured to rotate in a range that does not intersect an imaginary reference surface extending from a surface of the reference adjustment unit; and\nwherein the straight adjustment unit is configured to rotate in a range that intersects (or crosses) the imaginary reference surface.",
                "12. The display device of claim 1, wherein the hinge portion comprises:\na shaft receiving portion and a hinge case comprising a first gear receiving portion and a second gear receiving portion disposed respectively on two sides of the shaft receiving portion;\na first hinge shaft and a second hinge shaft disposed in the shaft receiving portion;\na first gear and a second gear disposed in the first gear receiving portion, the first and second gears are interlocked with each other;\na third gear and a fourth gear disposed in the second gear receiving portion, the third and fourth gears are interlocked with each other;\na first gear cover covering a first opening formed in the first gear receiving portion, the first gear cover comprising through holes through which axes of the first and second gears are respectively disposed and exposed outwards;\na second gear cover covering a second opening formed in the second gear receiving portion, the second gear cover comprising through holes through which axes of the third and fourth gears are respectively disposed and exposed outwards;\na first coupling portion coupling the axis of the first gear to one side of the first frame portion;\na second coupling portion coupling the axis of the third gear to the opposite side of the first frame portion;\na third coupling portion coupling the axis of the second gear to one side of the second frame portion; and\na fourth coupling portion coupling the axis of the fourth gear to the opposite side of the second frame portion.",
                "13. The display device of claim 12, wherein the hinge portion further comprises a washer disposed on at least one of positions between one side of the first gear cover and the first coupling portion, between the opposite side of the first gear cover and the third coupling portion, between one side of the second gear cover and the second coupling portion, and between the opposite side of the second gear cover and the fourth coupling portion.",
                "14. The display device of claim 12, wherein the first gear receiving portion comprises through holes into which the axes of the first and second gears are inserted; and\nwherein the second gear receiving portion comprises through holes into which the axes of the third and fourth gears are inserted.",
                "15. The display device of claim 12, wherein the shaft receiving portion comprises:\nfirst fixing grooves into which two ends of the first hinge shaft are respectively inserted;\nsecond fixing grooves into which two ends of the second hinge shaft are respectively inserted;\nat least one first support groove configured to support a central portion of the first hinge shaft; and\nat least one second support groove configured to support a central portion of the second hinge shaft.",
                "16. The display device of claim 12, wherein the first support portion is coupled to the first hinge shaft and the second support portion is coupled to the second hinge shaft.",
                "17. The display device of claim 16, wherein the first support portion comprises:\nat least one rotation unit rotatably coupled to a first hinge axis;\nat least one first support plate protruding from the rotation unit towards one side of the first curvature adjusting portion; and\nat least one second support plate protruding from the rotation unit towards another side of the first curvature adjusting portion.",
                "18. The display device of claim 17, further comprising at least one hinge spring coupled to the first hinge axis, one end of the hinge spring disposed on the first support plate and an other end of the hinge spring disposed on the shaft receiving portion.",
                "19. The display device of claim 16, wherein the second support portion comprises:\nat least one rotation unit rotatably coupled to a second hinge axis;\nat least one first support plate protruding from the rotation unit towards one side of the second curvature adjusting portion; and\nat least one second support plate protruding from the rotation unit towards another side of the second curvature adjusting portion.",
                "20. The display device of claim 19, further comprising at least one hinge spring coupled to the second hinge axis, one end of the hinge spring disposed on the first support plate and an other end of the hinge spring disposed on the shaft receiving portion."
            ]
        }
    ],
    "firstInventorToFileIndicator": "Y",
    "applicationStatusCode": 150,
    "applicationTypeCode": "UTL",
    "entityStatusData": {
        "smallEntityStatusIndicator": false,
        "businessEntityStatusCategory": "Regular Undiscounted"
    },
    "filingDate": "2019-06-13",
    "class/subclass": "361/679.27",
    "nationalStageIndicator": true,
    "firstInventorName": "Shanghung YEH",
    "cpcClassificationBag": [
        "G06F1/1641",
        "E05Y2999/00",
        "E05D3/122",
        "E05D7/00",
        "G06F1/1652",
        "G06F1/1681"
    ],
    "effectiveFilingDate": "2019-06-13",
    "publicationDateBag": [
        "2021-06-17"
    ],
    "publicationSequenceNumberBag": [
        "0181795"
    ],
    "earliestPublicationDate": "2021-06-17",
    "applicationTypeLabelName": "Utility",
    "applicationStatusDate": "2022-04-06",
    "class": "361",
    "applicationTypeCategory": "REGULAR",
    "applicationStatusDescriptionText": "Patented Case",
    "patentNumber": "11314283",
    "grantDate": "2022-04-26",
    "applicantBag": [
        {
            "applicantNameText": "WUHAN CHINA STAR OPTOELECTRONICS SEMICONDUCTOR DISPLAY TECHNOLOGY CO., LTD",
            "correspondenceAddressBag": [
                {
                    "cityName": "Wuhan",
                    "countryCode": "CN",
                    "postalCode": "430079",
                    "nameLineOneText": "WUHAN CHINA STAR OPTOELECTRONICS SEMICONDUCTOR DIS",
                    "nameLineTwoText": "PLAY TECHNOLOGY CO., LTD",
                    "countryName": "CHINA",
                    "addressLineOneText": "305 Room, Building C5, Biolake of Optics Valley",
                    "addressLineTwoText": "No.666 Gaoxin Avenue, Wuhan East Lake High-tech",
                    "postalAddressCategory": "postal"
                }
            ]
        }
    ],
    "firstApplicantName": "WUHAN CHINA STAR OPTOELECTRONICS SEMICONDUCTOR DISPLAY TECHNOLOGY CO., LTD",
    "customerNumber": 96995,
    "groupArtUnitNumber": "2847",
    "earliestPublicationNumber": "US20210181795A1",
    "inventionTitle": "FOLDABLE DISPLAY DEVICE",
    "applicationConfirmationNumber": 1990,
    "examinerNameText": "LEA EDMONDS, LISA S",
    "subclass": "679.27",
    "publicationCategoryBag": [
        "Granted/Issued",
        "Pre-Grant Publications - PGPub"
    ],
    "docketNumber": "251/77"
}