{
    "id": 2718,
    "abstract": "ABSTRACT  A method and an apparatus for providing a location based service in an electronic device are provided. The method includes classifying location information of the electronic device having a similar characteristic into a category and mapping an operation of the electronic device according to the catego ry.  -31-",
    "initialClaims": [
        "1. A method for providing a location based service in an electronic device, the method comprising: classifying location information of the electronic device having a similar characteristic into a category; and mapping an operation of the electronic device according to the category.",
        "2. The method of claim 1, wherein the operation of the electronic device comprises at least one of control settings of the electronic device, execution of application programs, and an initial mode when an application program is executed.",
        "3. A method for providing a location based service in an electronic device, the method comprising: detecting location information of the electronic device; determining a category comprising the location information of the electronic device; determining an operation of the electronic device, which is mapped to the category; and performing the operation of the electronic device.",
        "4. The method of claim 3, wherein the performing of the operation of the electronic device comprises performing an operation recently performed in the category among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations.",
        "5. The method of claim 3, wherein the performing of the operation of the electronic device comprises performing an operation having the most number of times the operation is performed in the category among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations.",
        "6. The method of claim 3, wherein the performing of the operation of the electronic device comprises performing an operation having the most number of times the operation is performed in the category during a reference period among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations.",
        "7. A method for providing a location based service in an electronic device, the method comprising: detecting location information of the electronic device when the electronic device performs a first operation; determining a category comprising the location information of the electronic device; and mapping the first operation of the category.",
        "8. The method of claim 7, wherein the mapping of the first operation comprises: determining a number of times the first operation is performed in the category; and mapping the first operation to the category when the number of times the first operation is performed is greater than or equal to a reference number of times.",
        "9. The method of claim 7, wherein the mapping of the first operation comprises: determining a number of times the first operation is performed during a reference period in the category; and mapping the first operation to the category when the number of times the first operation is performed in the category during the reference period in the category is greater than or equal to a reference number of times.",
        "10. The method of claim 7, wherein the mapping of the first operation comprises: determining a number of times a second operation is performed in the category when there is the second operation in the category; and mapping the first operation to the category when the number of times the first operation is performed in the category is greater than or equal to the number of times the second operation is performed in the category.",
        "11. The method of claim 1, further comprising: detecting location information of the electronic device; determining the category of the location information; determining an operation mapped to the category; and performing the operation.",
        "12. An electronic device comprising: a memory; and at least one processor configured to detect location information of the electronic device, determine a category comprising the location information of the electronic device, determine an operation of the electronic device mapped to the category, and perform the operation.",
        "13. The electronic device of claim 12, wherein the at least one processor is further configured to perform an operation recently performed in the category among a plurality of operations when the operation mapped to the category comprises the plurality of operations.",
        "14. The electronic device of claim 12, wherein the at least one processor is further configured to perform an operation having the most number of times the operation is performed in the category among a plurality of operations when the operation mapped to the category comprises the plurality of operations.",
        "15. The electronic device of claim 12, wherein the at least one processor is further configured to perform an operation having the most number of times the operation is performed in the category during a reference period among a plurality of operations when the operation mapped to the category comprises the plurality of operations.",
        "16. An electronic device comprising: a memory; and at least one processor configured to detect location information of the electronic device when performing a first operation, determine a category comprising the location information of the electronic device, and map the first operation to the category.",
        "17. The electronic device of claim 16, wherein the at least one processor is further configured to determine a number of times the first operation is performed in the category and map the first operation to the category when the number of times the first operation is performed is greater than or equal to a reference number of times.",
        "18. The electronic device of claim 16, wherein the at least one processor is further configured to determine a number of times the first operation is performed during a reference period in the category and map the first operation to the category when the number of times the first operation is performed in the category during the reference period in the category is greater than or equal to a reference number of times.",
        "19. The electronic device of claim 16, wherein the at least one processor is further configured to determine a number of times a second operation is performed in the category when there is the second operation in the category and map the first operation to the category when the number of times the first operation is performed in the category is greater than or equal to the number of times the second operation is performed in the category.",
        "20. The electronic device of claim 16, wherein the at least one processor is further configured to detect the location information of the electronic device, determine the category of the location information of the electronic device, determine an operation mapped to the category, and perform the operation."
    ],
    "finalClaims": [
        "1. (Cancelled)",
        "2. (Cancelled)",
        "3. A method for providing a location based service in an electronic device, the method comprising: detecting location information of the electronic device; identifying a category corresponding to the location information based on map data in the electronic device; determining an operation of a plurality of operations of the electronic device previously mapped to the category based on at least one of a time when the operation is performed and a number of times which the operation is performed; and performing the operation of the electronic device, wherein the plurality of operations of the electronic device were previously mapped to the category based on at least one of a time when the operation has been performed or a number of times which the operation has been performed, and wherein the determining of the operation of the plurality of operations comprises determining the most recently performed operation of the plurality of operations or the most frequently performed operation of the plurality of operations.",
        "4. (Cancelled)",
        "5. (Cancelled)",
        "6. The method of claim 3, wherein, when the determining of the operation of the plurality of operations comprises determining the most frequently performed operation of the plurality of operations, the determining of the operation of the electronic device comprises determining an operation having the most number of times the operation is performed in the category during a reference period among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations.",
        "7. The method of claim 3, further comprising: performing an operation; detecting location information of the electronic device; determining a category representing a type of the location information based on map data in the electronic device; and mapping the operation to the category.",
        "8. The method of claim 7, wherein the mapping of the first operation comprises: determining a number of times which the operation is performed in the category; and mapping the operation to the category when the number of times which the operation is performed is greater than or equal to a reference number of times.",
        "9. The method of claim 7, wherein the mapping of the operation comprises: determining a number of times which the operation is performed during a reference period in the category; and mapping the operation to the category when the number of times which the operation is performed in the category during the reference period in the category is greater than or equal to a reference number of times.",
        "10. The method of claim 3, further comprising: detecting location information of the electronic device; determining a category representing a type of the location information based on map data in the electronic device; and mapping an operation of the electronic device to the category.",
        "11. The method of claim 3, wherein the operation of the electronic device comprises at least one of control settings of the electronic device, execution of application programs, and or an initial mode when an application program is executed.",
        "12. An electronic device comprising: a memory; and at least one processor configured to: detect location information of the electronic device, identify a category corresponding to the location information based on map data in the memory, determine an operation of a plurality of operations of the electronic device previously mapped to the category based on at least one of a time when the operation is performed and a number of times which the operation is performed, and perform the operation, wherein the plurality of operations of the electronic device were previously mapped to the category based on at least one of a time when the operation has been performed or a number of times which the operation has been performed, and wherein the determining of the operation of the plurality of operations comprises determining the most recently performed operation of the plurality of operations or the most frequently performed operation of the plurality of operations.",
        "13. (Cancelled)",
        "14. (Cancelled)",
        "15. The electronic device of claim 12, wherein the at least one processor is further configured to, when the determining of the operation of the plurality of operations comprises determining the most frequently performed operation of the plurality of operations, determine an operation having the most number of times the operation is performed in the category during a reference period among a plurality of operations when the operation mapped to the category comprises the plurality of operations.",
        "16. The electronic device of claim 12, wherein the at least one processor is further configured to: perform an operation, detect location information of the electronic device, determine a category representing a type of the location information based on map data in the memory, and map the operation to the category.",
        "17. The electronic device of claim 16, wherein the at least one processor is further configured to determine a number of times which the operation is performed in the category and map the operation to the category when the number of times which the operation is performed is greater than or equal to a reference number of times.",
        "18. The electronic device of claim 16, wherein the at least one processor is further configured to determine a number of times which the operation is performed during a reference period in the category and map the operation to the category when the number of times which the operation is performed in the category during the reference period in the category is greater than or equal to a reference number of times.",
        "19. The electronic device of claim 12, wherein the at least one processor is further configured to: detect location information of the electronic device, determine a category representing a type of the location information based on map data in the electronic device, and map an operation of the electronic device to the category.",
        "20. The electronic device of claim 12, wherein the operation of the electronic device comprises at least one of control settings of the electronic device, execution of application programs, and or an initial mode when an application mode is executed."
    ],
    "CTNFDocumentIdentifier": "I87P6JIAPXXIFW4",
    "CTNFBodyText": "DETAILED ACTION\nThe present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA . \nPriority\nReceipt is acknowledged of papers submitted under 35 U.S.C. 119(a)-(d), which papers have been placed of record in the file. \nInformation Disclosure Statement\nThe information disclosure statement submitted on April 8, 2014 and December 1, 2014 have been considered by the Examiner and made of record in the application file.\nClaim Rejections - 35 USC § 102\nThe following is a quotation of the appropriate paragraphs of 35 U.S.C. 102 that form the basis for the rejections under this section made in this Office action:\nA person shall be entitled to a patent unless –\n\n(a)(1) the claimed invention was patented, described in a printed publication, or in public use, on sale or otherwise available to the public before the effective filing date of the claimed invention.\n\n\nClaims 1-20 are rejected under 35 U.S.C. 102(a)(1) as being anticipated by Lee et al (US Pat. Pub. No. 2009/0170532).\n\nRegarding claim 1, Lee et al discloses a method for providing a location based service in an electronic device, the method comprising: classifying location information of the electronic device having a similar characteristic into a category (paragraph 48);  and mapping an operation of the electronic device according to the category (paragraph 47). \nRegarding claim 2, Lee et al discloses the operation of the electronic device comprises at least one of control settings of the electronic device, execution of application programs, and an initial mode when an application program is executed. \nRegarding claim 3, Lee et al discloses a method for providing a location based service in an electronic device, the method comprising: detecting location information of the electronic device (paragraph 36); determining a category comprising the location information of the electronic device (paragraph 48); determining an operation of the electronic device, which is mapped to the category (paragraph 47); and performing the operation of the electronic device (paragraph 47). \nRegarding claim 4, Lee et al discloses the performing of the operation of the electronic device comprises performing an operation recently performed in the category among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations (paragraph 36 and 47). \nRegarding claim 5, Lee et al discloses the performing of the operation of the electronic device comprises performing an operation having the most number of times the operation is performed in the category among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations (paragraph 36-37). \nRegarding claim 6, Lee et al discloses the performing of the operation of the electronic device comprises performing an operation having the most number of times  the operation is performed in the category during a reference period among a plurality of operations when the operation of the electronic device, which is mapped to the category, comprises the plurality of operations (paragraph 36-37). \nRegarding claim 7, Lee et al discloses a method for providing a location based service in an electronic device, the method comprising: detecting location information of the electronic device when the electronic device performs a first operation (paragraph 36 and 48); determining a category comprising the location information of the electronic device (paragraph 48); and mapping the first operation of the category (paragraph 47). \nRegarding claim 8, Lee et al discloses the mapping of the first operation comprises: determining a number of times the first operation is performed in the category; and mapping the first operation to the category when the number of times the first operation is performed is greater than or equal to a reference number of times (paragraph 36-37). \nRegarding claim 9, Lee et al discloses the mapping of the first operation comprises: determining a number of times the first operation is performed during a reference period in the category; and mapping the first operation to the category when the number of times the first operation is performed in the category during the reference period in the category is greater than or equal to a reference number of times (paragraph 36-37). \nRegarding claim 10, Lee et al discloses the mapping of the first operation comprises: determining a number of times a second operation is performed in the category when there is the second operation in the category; and mapping the first  operation to the category when the number of times the first operation is performed in the category is greater than or equal to the number of times the second operation is performed in the category (paragraph 36-37). \nRegarding claim 11, Lee et al discloses detecting location information of the electronic device (paragraph 36); determining the category of the location information (paragraph 48); determining an operation mapped to the category (paragraph 47); and performing the operation (paragraph 47). \nRegarding claim 12, Lee et al discloses an electronic device comprising: a memory; and at least one processor configured to detect location information of the electronic device (paragraph 36), determine a category comprising the location information of the electronic device (paragraph 48), determine an operation of the electronic device mapped to the category (paragraph 47), and perform the operation (paragraph 47). \nRegarding claim 13, Lee et al discloses the at least one processor is further configured to perform an operation recently performed in the category among a plurality of operations when the operation mapped to the category comprises the plurality of operations (paragraph 36 and 47). \nRegarding claim 14, Lee et al discloses the at least one processor is further configured to perform an operation having the most number of times the operation is performed in the category among a plurality of operations when the operation mapped to the category comprises the plurality of operations (paragraph 36-37). \n Regarding claim 15, Lee et al discloses the at least one processor is further configured to perform an operation having the most number of times the operation is performed in the category during a reference period among a plurality of operations when the operation mapped to the category comprises the plurality of operations (paragraph 36-37). \nRegarding claim 16, Lee et al discloses an electronic device comprising: a memory; and at least one processor configured to detect location information of the electronic device when performing a first operation (paragraph 36 and 47), determine a category comprising the location information of the electronic device (paragraph 48), and map the first operation to the category (paragraph 47). \nRegarding claim 17, Lee et al discloses the at least one processor is further configured to determine a number of times the first operation is performed in the category and map the first operation to the category when the number of times the first operation is performed is greater than or equal to a reference number of times (paragraph 36-37). \nRegarding claim 18, Lee et al discloses the at least one processor is further configured to determine a number of times the first operation is performed during a reference period in the category and map the first operation to the category when the number of times the first operation is performed in the category during the reference period in the category is greater than or equal to a reference number of times (paragraph 36-37). \n Regarding claim 19, Lee et al discloses the at least one processor is further configured to determine a number of times a second operation is performed in the category when there is the second operation in the category and map the first operation to the category when the number of times the first operation is performed in the category is greater than or equal to the number of times the second operation is performed in the category (paragraph 36-37). \nRegarding claim 20, Lee et al discloses the at least one processor is further configured to detect the location information of the electronic device (paragraph 36), determine the category of the location information of the electronic device (paragraph 48), determine an operation mapped to the category (paragraph 47), and perform the operation (paragraph 47).\nConclusion\nThe prior art made of record and not relied upon is considered pertinent to applicant's disclosure. \n \tHammad et al (US Pat. Pub. No. 2013/0246220) and Raleigh et al (US Pat. Pub. No. 2012/0289147) are cited to show a method, which is considered pertinent to the claimed invention.\n",
    "NOABodyText": "CNTA  14/247,718  NOA  83736  2642    DETAILED ACTION  Notice of Pre-AIA or AIA Status  15-10-aia AIA 07-03-aia The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA.  DETAILED ACTION  Continued Examination Under 37 CFR 1.114  07-42-04 AIA A request for continued examination under 37 CFR 1.114, including the fee set forth in 37 CFR 1.17(e), was filed in this application after final rejection. Since this application is eligible for continued examination under 37 CFR 1.114, and the fee set forth in 37 CFR 1.17(e) has been timely paid, the finality of the previous Office Action has been withdrawn pursuant to 37 CFR 1.114. Applicant’s submission filed on July 31, 2017 has been entered.  Allowable Subject Matter  12-151-07 AIA 07-97 12-51-07 Claim s 3, 6-12 and 15-20 are allowed.  13-03 AIA The following is an Examiner’s statement of reasons for allowance:  Consider claims 3 and 12, the applicant’s amendment and remark filed on July 31, 2017 have been considered and found to be persuasive.  In agreement with the Applicant's remarks, the prior art failed to disclose or suggest each and every limitation recited in claims 3 and 12 of the claimed invention when considered as a whole .  Any comments considered necessary by Applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled “Comments on Statement of Reasons for Allowance.”   Conclusion  Any response to this Office Action should be:  Faxed to: (571) 273-8300   Mailed to:  Commissioner for Patents  P.O. Box 1450  Alexandria, VA 22313-1450   Hand-delivered responses should be brought to:  Customer Service Window  Randolph Building  401 Dulany Street  Alexandria, VA 22314.   Any inquiry concerning this communication or earlier communications from the examiner should be directed to LITON MIAH whose telephone number is (571)270-3124.  The examiner can normally be reached on Monday through Friday 7:30am to 5:00pm EST.  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisor, Rafael Perez--Gutierrez can be reached on (571)272-7915.  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see http://pair-direct.uspto.gov. Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free). If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.       /LITON MIAH/  Primary Examiner, Art Unit 2642       Application/Control Number:  14/247,718  Page 2    Art Unit:  2642          Application/Control Number:  14/247,718  Page 3    Art Unit:  2642          Application/Control Number:  14/247,718  Page 4    Art Unit:  2642",
    "applicationNumber": "14247718",
    "patentsCitedByExaminer": [
        {
            "referenceIdentifier": "20120289147",
            "abstract": "Embodiments of methods, systems and apparatuses for distributing content over a communication network are disclosed. One method includes managing, by at least one content distribution server, a plurality of content, assisting in preloading at least a portion of the content to a storage element associated with a wireless device, identifying a portion of a user interface of the wireless device, and sending configuration information to the wireless device, the configuration information configured to assist the wireless device in placing, in the identified portion of the user interface, a service launch object that launches the content.",
            "claims": [
                "1. A method performed by a network system, the method comprising:\nmanaging a plurality of content, the plurality of content including a particular content;\nassisting in preloading at least a first portion of the particular content to a storage element coupled to the at least one content distribution server by a communication network;\nobtaining information to assist in identifying a portion of a user interface of a wireless device associated with the storage element, the wireless device communicatively coupled to the network system over a wireless access network;\nobtaining a service launch object associated with the particular content for placement in the identified portion of the user interface; and\nsending configuration information to the wireless device over the wireless access network, the configuration information configured to assist the wireless device in placing the service launch object in the identified portion of the user interface.",
                "2. The method of claim 1, further comprising selecting the particular content based on a value metric.",
                "3. The method of claim 1, further comprising selecting the particular content based on one or more of communication network information, storage element information, wireless device coupling with storage element information, wireless device information, wireless device usage state, and user information.",
                "4. The method of claim 1, wherein the particular content comprises one or more of video content, audio content, software, and an application.",
                "5. The method of claim 1, wherein assisting in preloading, as directed by the service provider, at least a portion of the particular content to the storage element coupled to the at least one content distribution server by the communication network comprises assisting in preloading the at least a portion of the particular content to the storage element in a secure format.",
                "6. The method of claim 1, wherein the service launch object is an icon for launching the particular content.",
                "7. The method of claim 1, further comprising allowing a user to access a second portion of the particular content, wherein the second portion of the content in conjunction with the at least a first portion of the content allows the user to consume the content.",
                "8. The method of claim 1, wherein the identified portion of the user interface comprises a particular partition of a plurality of partitions of the user interface.",
                "9. The method of claim 8, further comprising:\nclassifying at least one of the plurality of partitions based on ease of discovery to a user of the wireless device, and based on the result of classifying the at least one of the plurality of partitions, placing the service launch object in a particular partition of the plurality of partitions.",
                "10. The method of claim 1, wherein the configuration information is further configured to assist the wireless device in one or more of:\nenabling or launching the particular content when a user selects the service launch object, and providing additional management functions associated with the particular content when the user selects the service launch object.",
                "11. The method of claim 1, further comprising providing a view of the user interface to a network system manager.",
                "12. The method of claim 1, wherein the particular content is associated with a particular entity of a plurality of entities, and further comprising:\nobtaining bids from one or more of the plurality of entities, including the particular entity; and\nidentifying the particular entity as a winning bidder.",
                "13. The method of claim 1, further comprising:\ndetermining a differentiating attribute of the identified portion of the user interface; and\ndetermining the configuration information based on the differentiating attribute.",
                "14. The method of claim 1, wherein at least one of the communication network and the wireless access network is a cellular network.",
                "15. A network system comprising:\nmeans for managing a plurality of content, the plurality of content including a particular content;\nmeans for assisting in preloading at least a first portion of the particular content to a storage element coupled to the at least one content distribution server by a communication network;\nmeans for obtaining information to assist in identifying a portion of a user interface of a wireless device associated with the storage element, the wireless device communicatively coupled to the network system over a wireless access network;\nmeans for obtaining a service launch object associated with the particular content for placement in the identified portion of the user interface; and\nmeans for sending configuration information to the wireless device over the wireless access network, the configuration information configured to assist the wireless device in placing the service launch object in the identified portion of the user interface.",
                "16. The network system recited in claim 15, wherein the means for managing the plurality of content include a server.",
                "17. The network system recited in claim 16, wherein at least one of the communication network and the wireless access network is a cellular network.",
                "18. The network system recited in claim 15, wherein the particular content comprises one or more of video content, audio content, software, and an application.",
                "19. The network system recited in claim 15, wherein the service launch object is an icon for launching the particular content.",
                "20. The network system recited in claim 15, wherein the particular content is associated with a particular entity of a plurality of entities, and further comprising:\nmeans for obtaining bids from one or more of the plurality of entities, including the particular entity; and\nmeans for identifying the particular entity as a winning bidder.",
                "21. A network system comprising:\na communications interface for enabling the network system to communicate with a wireless device over a wireless access network, the wireless device associated with a storage element communicatively coupled to the network system by a communication network; and\none or more network elements configured to:\nmanage a plurality of content, the plurality of content including a particular content, assist in preloading at least a first portion of the particular content to the storage element, obtain information to assist in identifying a portion of a user interface of the wireless device, obtain a service launch object associated with the particular content for placement in the identified portion of the user interface, and send configuration information to the wireless device over the wireless access network, the configuration information configured to assist the wireless device in placing the service launch object in the identified portion of the user interface.",
                "22. The network system recited in claim 21, wherein at least one of the communication network and the wireless access network is a cellular network.",
                "23. The network system recited in claim 21, wherein the particular content comprises one or more of video content, audio content, software, and an application.",
                "24. The network system recited in claim 21, wherein the service launch object is an icon for launching the particular content.",
                "25. The network system recited in claim 21, wherein the particular content is associated with a particular entity of a plurality of entities, and wherein the one or more network elements are further configured to:\nobtain bids from one or more of the plurality of entities, including the particular entity, and identify the particular entity as a winning bidder."
            ]
        },
        {
            "referenceIdentifier": "20130246220",
            "abstract": "Embodiments of the invention are directed to systems, apparatuses, and methods for determining the location of a mobile merchant, and performing further processing based on the determined location. Transaction data for a transaction conducted by a mobile merchant is electronically received at a server computer. The server computer determines a location of the mobile merchant based on the transaction data, and performs further processing based on the location of the mobile merchant.",
            "claims": [
                "1. A method, performed by a server computer, the method comprising:\nelectronically receiving transaction data for a transaction conducted by a mobile merchant;\ndetermining, by the server computer, a location of the mobile merchant based on the transaction data; and\nperforming further processing based on the location of the mobile merchant.",
                "2. The method of claim 1, wherein the further processing comprises:\ndetermining, by the server computer, a location of a client device;\ngenerating a notification including the location of the mobile merchant; and\nelectronically transmitting the notification to the client device.",
                "3. The method of claim 2 further comprising, before generating the notification, determining that the distance between the location of the mobile merchant and the location of the client device is within a threshold value.",
                "4. The method of claim 1, wherein the received transaction data is included in an authorization request message or an authorization response message.",
                "5. The method of claim 2, wherein the client device is associated with a consumer.",
                "6. The method of claim 2, wherein the transaction is further conducted by a first consumer, wherein the client device is associated with a second consumer, and wherein the method further comprises:\ndetermining, by the server computer, that the first consumer is associated with a social network; and\ndetermining, by the server computer, that the second consumer is associated with the social network.",
                "7. The method of claim 2, wherein the client device is associated with a stationary merchant, and wherein determining the location of the client device comprises determining the location of the stationary merchant.",
                "8. The method of claim 2, wherein the mobile merchant is a first mobile merchant, and wherein the client device is associated with a second mobile merchant.",
                "9. The method of claim 2 further comprising electronically receiving coupon data from the mobile merchant, wherein the generated notification further includes the coupon data.",
                "10. The method of claim 1, wherein the server computer is located in a payment processing network configured to process electronic payment transactions and to provide clearing and settlement services.",
                "11. A server computer comprising:\na processor; and\na computer readable medium coupled to the processor, wherein the computer readable medium comprises code executable by the processor for implementing a method comprising:\nelectronically receiving transaction data for a transaction conducted by a mobile merchant;\ndetermining a location of the mobile merchant based on the transaction data; and\nperforming further processing based on the location of the mobile merchant.",
                "12. The server computer of claim 11, wherein the further processing comprises:\ndetermining a location of a client device;\ngenerating a notification including the location of the mobile merchant; and\nelectronically transmitting the notification to the client device.",
                "13. The server computer of claim 12, wherein the method further comprises, before generating the notification, determining that the distance between the location of the mobile merchant and the location of the client device is within a threshold value.",
                "14. The server computer of claim 12, wherein the client device is associated with a consumer.",
                "15. The server computer of claim 12, wherein the transaction is further conducted by a first consumer, wherein the client device is associated with a second consumer, and wherein the method further comprises:\ndetermining, by the server computer, that the first consumer is associated with a social network; and\ndetermining, by the server computer, that the second consumer is associated with the social network.",
                "16. The server computer of claim 12, wherein the client device is associated with a stationary merchant, and wherein determining the location of the client device comprises determining the location of the stationary merchant.",
                "17. The server computer of claim 12, wherein the mobile merchant is a first mobile merchant, and wherein the client device is associated with a second mobile merchant.",
                "18. A method, performed by a mobile access device associated with a mobile merchant, the method comprising electronically transmitting transaction data for a transaction conducted by the mobile merchant to a server computer associated with a payment processing network, wherein the server computer:\ndetermines a location of the mobile merchant based on the transaction data; and\nperforms further processing based on the location of the mobile merchant.",
                "19. The method of claim 18, wherein the further processing comprises:\ndetermining a location of a client device;\ngenerating a notification including the location of the mobile merchant; and\nelectronically transmitting the notification to the client device.",
                "20. The method of claim 19 further comprising generating an authorization request message including the transaction data for the transaction, wherein electronically transmitting the transaction data comprises electronically transmitting the authorization request message."
            ]
        },
        {
            "referenceIdentifier": "20090170532",
            "abstract": "Event-based modes of operation are supported on an electronic device. One or more event-based modes of operation may be automatically or selectively applied to the device when a new life event is detected. The device's previous mode of operation may be backed up to the device or a network location and restored after the event-based mode of operation is no longer applied. The event-based modes of operation may be used to restrict access to certain applications or functionalities on the device, enforce or restrict certain user interface or other types of settings, and add or remove or rearrange the priority of device assets. The new life events associated with event-based modes of operation may be of various types, including location-based events, environment-based events, calendar-based events, news-based events, and usage-based events.",
            "claims": [
                "1. A method for supporting location-based modes of operation on an electronic device, the method comprising:\naccessing location information associated with the electronic device;\ndetermining, based at least in part on the accessed location information, if the electronic device is located within at least one location-based zone; and\nin response to determining that the electronic device is located within the at least one location-based zone, applying at least one location-based mode of operation to the electronic device.",
                "2. The method of claim 1, wherein the applying to the electronic device the at least one location-based mode of operation comprises adjusting at least one configuration characteristic of the electronic device.",
                "3. The method of claim 2, further comprising restricting the re-adjustment of the at least one configuration characteristic of the electronic device while the electronic device is located within the at least one location-based zone.",
                "4. The method of claim 2, wherein the at least one configuration characteristic is at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "5. The method of claim 2, wherein the adjusting the at least one configuration characteristic of the electronic device comprises one of (disabling at least one function of the electronic device and (enabling at least one function of the electronic device.",
                "6. The method of claim 5, wherein the one of disabling and enabling the at least one function respectively comprises one of (disabling at least one network interface on the electronic device and (enabling at least one network interface on the electronic device.",
                "7. The method of claim 2, wherein the adjusting the at least one configuration characteristic of the electronic device comprises adjusting at least one of (an audio setting on the electronic device and (a display setting on the electronic device.",
                "8. The method of claim 2, wherein the adjusting the at least one configuration characteristic of the electronic device comprises altering at least one asset of the electronic device.",
                "9. The method of claim 8, wherein the altering the at least one asset of the electronic device comprises one of (loading the at least one asset onto the electronic device and (removing the at least one asset from the electronic device.",
                "10. The method of claim 8, wherein the altering the at least one asset of the electronic device comprises one of (changing the priority of the at least one asset with respect to at least one other asset of the electronic device and (changing the presentation of the at least one asset.",
                "11. The method of claim 1, wherein the accessing the location information associated with the electronic device comprises determining the location of the electronic device using at least one of (a global positioning system receiver, (a triangulation sensor, and (a communications network connection.",
                "12. The method of claim 1, wherein the determining if the electronic device is located within the at least one location-based zone comprises:\naccessing zone information;\ncomparing the accessed location information to the accessed zone information; and\ndetermining if the electronic device is located within the at least one location-based zone based at least in part on the comparison.",
                "13. The method of claim 12, wherein the accessing the zone information comprises at least partially accessing the zone information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "14. The method of claim 12, wherein the at least one location-based zone comprises at least one bounded geographic region, and wherein the accessing the zone information comprises accessing geographic coordinates for the at least one bounded geographic region.",
                "15. The method of claim 1, wherein the at least one location-based zone comprises at least one bounded geographic region, and wherein the at least one bounded geographic region comprises at least two non-contiguous geographic regions.",
                "16. The method of claim 1, wherein the applying the at least one location-based mode of operation to the electronic device comprises:\naccessing mode information associated with the at least one location-based zone; and\napplying to the electronic device the accessed mode information, wherein, the accessing the mode information comprises at least partially accessing the mode information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "17. The method of claim 1, further comprising backing up at least one configuration characteristic of the electronic device before the applying the at least one location-based mode of operation to the electronic device.",
                "18. The method of claim 17, further comprising:\ndetermining when the electronic device is no longer located within the at least one location-based zone; and\nin response to the determining that the electronic device is no longer located in the at least one location-based zone, restoring to the electronic device the backed up at least one configuration characteristic.",
                "19. A method for supporting location-based modes of operation on an electronic device, the method comprising:\ndetecting a wireless network with the electronic device;\naccessing an identification of at least one location-based mode of operation associated with the wireless network;\npresenting a listing comprising the identification of the at least one location-based mode of operation;\nreceiving a user selection of the at least one location-based mode of operation from the listing; and\nin response to receiving the user selection, applying the at least one location-based mode of operation to the electronic device.",
                "20. The method of claim 19, wherein the detecting the wireless network comprises connecting the electronic device to the wireless network, and wherein the accessing the identification comprises downloading the identification to the electronic device from the wireless network.",
                "21. The method of claim 19, wherein the applying the at least one location-based mode of operation comprises adjusting at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "22. A system for supporting location-based modes of operation on an electronic device, the system comprising:\nmemory configured to store zone information about at least one location-based zone; and\nthe electronic device, the electronic device comprising:\na location detection module configured to determine the location of the electronic device; and\na control module coupled to the location detection module, wherein the control module is configured to:\naccess the stored zone information about the at least one location-based zone;\ncompare the determined location of the electronic device to the accessed zone information; and\napply at least one location-based mode of operation to the electronic device based at least in part on the comparison.",
                "23. The system of claim 22, wherein at least a portion of the memory is located on one of (the electronic device and (a server external to the electronic device.",
                "24. The system of claim 22, wherein the location detection module comprises at least one of (a global positioning system receiver, (a triangulation sensor, (a communications network receiver, and (program logic configured to compute the current geographic location of the electronic device.",
                "25. The system of claim 22, wherein the at least one location-based mode of operation comprises an adjustment of at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "26. A method for supporting environment-based modes of operation on an electronic device, the method comprising:\naccessing environment information associated with the electronic device;\ndetermining, based at least in part on the accessed environment information, if the electronic device is experiencing at least one environment-based event; and\nin response to determining that the electronic device is experiencing the at least one environment-based event, applying at least one environment-based mode of operation to the electronic device.",
                "27. The method of claim 26, wherein the applying to the electronic device the at least one environment-based mode of operation comprises adjusting at least one configuration characteristic of the electronic device.",
                "28. The method of claim 27, further comprising restricting the re-adjustment of the at least one configuration characteristic of the electronic device while the electronic device is experiencing the at least one environment-based event.",
                "29. The method of claim 27, wherein the at least one configuration characteristic is at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "30. The method of claim 27, wherein the adjusting the at least one configuration characteristic of the electronic device comprises one of (disabling at least one function of the electronic device and (enabling at least one function of the electronic device.",
                "31. The method of claim 30, wherein the one of disabling and enabling the at least one function respectively comprises one of (disabling at least one network interface on the electronic device and (enabling at least one network interface on the electronic device.",
                "32. The method of claim 27, wherein the adjusting the at least one configuration characteristic of the electronic device comprises adjusting at least one of (an audio setting on the electronic device and (a display setting on the electronic device.",
                "33. The method of claim 27, wherein the adjusting the at least one configuration characteristic of the electronic device comprises altering at least one asset of the electronic device.",
                "34. The method of claim 33, wherein the altering the at least one asset of the electronic device comprises one of (loading the at least one asset onto the electronic device and (removing the at least one asset from the electronic device.",
                "35. The method of claim 33, wherein the altering the at least one asset of the electronic device comprises one of (changing the priority of the at least one asset with respect to at least one other asset of the electronic device and (changing the presentation of the at least one asset.",
                "36. The method of claim 26, wherein the accessing the environment information associated with the electronic device comprises determining at least one environmental condition of the electronic device using at least one of (an accelerometer, (a gyroscope, (a magnetometer, (a light sensor, (a linear velocity sensor, (a thermal sensor, (an acoustic sensor, (a sonar sensor, (a radar sensor, (an image sensor, (a video sensor, and (an electrical charge sensor.",
                "37. The method of claim 26, wherein the determining if the electronic device is experiencing the at least one environment-based event comprises:\naccessing event information;\ncomparing the accessed environment information to the accessed event information; and\ndetermining if the electronic device is experiencing the at least one environment-based event based at least in part on the comparison.",
                "38. The method of claim 37, wherein the accessing the event information comprises at least partially accessing the event information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "39. The method of claim 37, wherein the at least one environment-based event comprises at least one threshold level for at least one environmental condition, and wherein the accessing the event information comprises accessing a value for the at least one threshold level.",
                "40. The method of claim 26, wherein the at least one environment-based event comprises at least two distinct ranges of values for at least one environmental condition.",
                "41. The method of claim 26, wherein the applying the at least one environment-based mode of operation to the electronic device comprises:\naccessing mode information associated with the at least one environment-based event; and\napplying to the electronic device the accessed mode information, wherein, the accessing the mode information comprises at least partially accessing the mode information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "42. The method of claim 26, further comprising backing up at least one configuration characteristic of the electronic device before the applying the at least one environment-based mode of operation to the electronic device.",
                "43. The method of claim 42, further comprising:\ndetermining when the electronic device is no longer experiencing the at least one environment-based event; and\nin response to the determining that the electronic device is no longer experiencing the at least one environment-based event, restoring to the electronic device the backed up at least one configuration characteristic.",
                "44. A method for supporting environment-based modes of operation on an electronic device, the method comprising:\ndetecting a wireless network with the electronic device;\naccessing an identification of at least one environment-based mode of operation associated with the wireless network;\npresenting a listing comprising the identification of the at least one environment-based mode of operation;\nreceiving a user selection of the at least one environment-based mode of operation from the listing; and\nin response to receiving the user selection, applying the at least one environment-based mode of operation to the electronic device.",
                "45. The method of claim 44, wherein the detecting the wireless network comprises connecting the electronic device to the wireless network, and wherein the accessing the identification comprises downloading the identification to the electronic device from the wireless network.",
                "46. The method of claim 44, wherein the applying the at least one environment-based mode of operation comprises adjusting at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "47. A system for supporting environment-based modes of operation on an electronic device, the system comprising:\nmemory configured to store event information about at least one environment-based event; and\nthe electronic device, the electronic device comprising:\nan environment detection module configured to determine at least one environmental condition of the electronic device; and\na control module coupled to the environment detection module, wherein the control module is configured to:\naccess the stored event information about the at least one environment-based event;\ncompare the at least one environmental condition of the electronic device to the accessed event information; and\napply at least one environment-based mode of operation to the electronic device based at least in part on the comparison.",
                "48. The system of claim 47, wherein at least a portion of the memory is located on one of (the electronic device and (a server external to the electronic device.",
                "49. The system of claim 47, wherein the environment detection module comprises at least one of (an accelerometer, (a gyroscope, (a magnetometer, (a light sensor, (a linear velocity sensor, (a thermal sensor, (an acoustic sensor, (a sonar sensor, (a radar sensor, (an image sensor, (a video sensor, and (an electrical charge sensor.",
                "50. The system of claim 47, wherein the at least one environment-based mode of operation comprises an adjustment of at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "51. A method for supporting calendar-based modes of operation on an electronic device, the method comprising:\naccessing calendar information associated with the electronic device;\ndetermining, based at least in part on the accessed calendar information, if the electronic device is experiencing at least one calendar-based event; and\nin response to determining that the electronic device is experiencing the at least one calendar-based event, applying at least one calendar-based mode of operation to the electronic device.",
                "52. The method of claim 51, wherein the applying to the electronic device the at least one calendar-based mode of operation comprises adjusting at least one configuration characteristic of the electronic device.",
                "53. The method of claim 52, further comprising restricting the re-adjustment of the at least one configuration characteristic of the electronic device while the electronic device is experiencing the at least one calendar-based event.",
                "54. The method of claim 52, wherein the at least one configuration characteristic is at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "55. The method of claim 52, wherein the adjusting the at least one configuration characteristic of the electronic device comprises one of (disabling at least one function of the electronic device and (enabling at least one function of the electronic device.",
                "56. The method of claim 55, wherein the one of disabling and enabling the at least one function respectively comprises one of (disabling at least one network interface on the electronic device and (enabling at least one network interface on the electronic device.",
                "57. The method of claim 52, wherein the adjusting the at least one configuration characteristic of the electronic device comprises adjusting at least one of (an audio setting on the electronic device and (a display setting on the electronic device.",
                "58. The method of claim 52, wherein the adjusting the at least one configuration characteristic of the electronic device comprises altering at least one asset of the electronic device.",
                "59. The method of claim 58, wherein the altering the at least one asset of the electronic device comprises one of (loading the at least one asset onto the electronic device and (removing the at least one asset from the electronic device.",
                "60. The method of claim 58, wherein the altering the at least one asset of the electronic device comprises one of (changing the priority of the at least one asset with respect to at least one other asset of the electronic device and (changing the presentation of the at least one asset.",
                "61. The method of claim 51, wherein the accessing the calendar information associated with the electronic device comprises determining at least one temporal condition of the electronic device using at least one of (a clock, (a differential clock, (a counter, (a differential counter, (a timer, and (a calendar.",
                "62. The method of claim 51, wherein the determining if the electronic device is experiencing the at least one calendar-based event comprises:\naccessing event information;\ncomparing the accessed calendar information to the accessed event information; and\ndetermining if the electronic device is experiencing the at least one calendar-based event based at least in part on the comparison.",
                "63. The method of claim 62, wherein the accessing the event information comprises at least partially accessing the event information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "64. The method of claim 62, wherein the at least one calendar-based event comprises at least one threshold level for at least one temporal condition, and wherein the accessing the event information comprises accessing a value for the at least one threshold level.",
                "65. The method of claim 51, wherein the at least one calendar-based event comprises at least two distinct ranges of values for at least one temporal condition.",
                "66. The method of claim 51, wherein the applying the at least one calendar-based mode of operation to the electronic device comprises:\naccessing mode information associated with the at least one calendar-based event; and\napplying to the electronic device the accessed mode information, wherein, the accessing the mode information comprises at least partially accessing the mode information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "67. The method of claim 51, further comprising backing up at least one configuration characteristic of the electronic device before the applying the at least one calendar-based mode of operation to the electronic device.",
                "68. The method of claim 67, further comprising:\ndetermining when the electronic device is no longer experiencing the at least one calendar-based event; and\nin response to the determining that the electronic device is no longer experiencing the at least one calendar-based event, restoring to the electronic device the backed up at least one configuration characteristic.",
                "69. A method for supporting calendar-based modes of operation on an electronic device, the method comprising:\ndetecting a wireless network with the electronic device;\naccessing an identification of at least one calendar-based mode of operation associated with the wireless network;\npresenting a listing comprising the identification of the at least one calendar-based mode of operation;\nreceiving a user selection of the at least one calendar-based mode of operation from the listing; and\nin response to receiving the user selection, applying the at least one calendar-based mode of operation to the electronic device.",
                "70. The method of claim 69, wherein the detecting the wireless network comprises connecting the electronic device to the wireless network, and wherein the accessing the identification comprises downloading the identification to the electronic device from the wireless network.",
                "71. The method of claim 69, wherein the applying the at least one calendar-based mode of operation comprises adjusting at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "72. A system for supporting calendar-based modes of operation on an electronic device, the system comprising:\nmemory configured to store event information about at least one calendar-based event; and\nthe electronic device, the electronic device comprising:\na calendar detection module configured to determine at least one temporal condition of the electronic device; and\na control module coupled to the calendar detection module, wherein the control module is configured to:\naccess the stored event information about the at least one calendar-based event;\ncompare the at least one temporal condition of the electronic device to the accessed event information; and\napply at least one calendar-based mode of operation to the electronic device based at least in part on the comparison.",
                "73. The system of claim 72, wherein at least a portion of the memory is located on one of (the electronic device and (a server external to the electronic device.",
                "74. The system of claim 72, wherein the calendar detection module comprises at least one of (a clock, (a differential clock, (a counter, (a differential counter, (a timer, and (a calendar.",
                "75. The system of claim 72, wherein the at least one calendar-based mode of operation comprises an adjustment of at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "76. A method for supporting news-based modes of operation on an electronic device, the method comprising:\naccessing news information associated with the electronic device;\ndetermining, based at least in part on the accessed news information, if the electronic device is experiencing at least one news-based event; and\nin response to determining that the electronic device is experiencing the at least one news-based event, applying at least one news-based mode of operation to the electronic device.",
                "77. The method of claim 76, wherein the applying to the electronic device the at least one news-based mode of operation comprises adjusting at least one configuration characteristic of the electronic device.",
                "78. The method of claim 77, further comprising restricting the re-adjustment of the at least one configuration characteristic of the electronic device while the electronic device is experiencing the at least one calendar-based event.",
                "79. The method of claim 77, wherein the at least one configuration characteristic is at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "80. The method of claim 77, wherein the adjusting the at least one configuration characteristic of the electronic device comprises one of (disabling at least one function of the electronic device and (enabling at least one function of the electronic device.",
                "81. The method of claim 80, wherein the one of disabling and enabling the at least one function respectively comprises one of (disabling at least one network interface on the electronic device and (enabling at least one network interface on the electronic device.",
                "82. The method of claim 77, wherein the adjusting the at least one configuration characteristic of the electronic device comprises adjusting at least one of (an audio setting on the electronic device and (a display setting on the electronic device.",
                "83. The method of claim 77, wherein the adjusting the at least one configuration characteristic of the electronic device comprises altering at least one asset of the electronic device.",
                "84. The method of claim 83, wherein the altering the at least one asset of the electronic device comprises one of (loading the at least one asset onto the electronic device and (removing the at least one asset from the electronic device.",
                "85. The method of claim 83, wherein the altering the at least one asset of the electronic device comprises one of (changing the priority of the at least one asset with respect to at least one other asset of the electronic device and (changing the presentation of the at least one asset.",
                "86. The method of claim 76, wherein the accessing the news information associated with the electronic device comprises determining at least one news condition of the electronic device using at least one of (a 802.11 communications protocol, (an Ethernet communications protocol, (a Bluetooth communications protocol, (a high frequency system communications protocol, (an infrared communications protocol, (a transmission control protocol/internet protocol communications protocol, (a global system for mobile communications protocol, (an enhanced data rates for global system for mobile communications evolution communications protocol, (a code division multiple access communications protocol, (a quadband communications protocol, (a voice over internet protocol communications protocol, (a hypertext transfer protocol communications protocol, (a BitTorrent communications protocol, (a file transfer protocol communications protocol, (a rapid transport protocol communications protocol, (a real-time streaming protocol communications protocol, (a secure shell protocol communications protocol, (a rich site summary communications protocol, and a (really simple syndication protocol communications protocol.",
                "87. The method of claim 76, wherein the determining if the electronic device is experiencing the at least one news-based event comprises:\naccessing event information;\ncomparing the accessed news information to the accessed event information; and\ndetermining if the electronic device is experiencing the at least one news-based event based at least in part on the comparison.",
                "88. The method of claim 87, wherein the accessing the event information comprises at least partially accessing the event information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "89. The method of claim 87, wherein the at least one news-based event comprises at least one threshold level for at least one news condition, and wherein the accessing the event information comprises accessing a value for the at least one threshold level.",
                "90. The method of claim 76, wherein the at least one news-based event comprises at least two distinct ranges of values for at least one news condition.",
                "91. The method of claim 76, wherein the applying the at least one news-based mode of operation to the electronic device comprises:\naccessing mode information associated with the at least one news-based event; and\napplying to the electronic device the accessed mode information, wherein, the accessing the mode information comprises at least partially accessing the mode information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "92. The method of claim 76, further comprising backing up at least one configuration characteristic of the electronic device before the applying the at least one news-based mode of operation to the electronic device.",
                "93. The method of claim 92, further comprising:\ndetermining when the electronic device is no longer experiencing the at least one news-based event; and\nin response to the determining that the electronic device is no longer experiencing the at least one news-based event, restoring to the electronic device the backed up at least one configuration characteristic.",
                "94. A method for supporting news-based modes of operation on an electronic device, the method comprising:\ndetecting a wireless network with the electronic device;\naccessing an identification of at least one news-based mode of operation associated with the wireless network;\npresenting a listing comprising the identification of the at least one news-based mode of operation;\nreceiving a user selection of the at least one news-based mode of operation from the listing; and\nin response to receiving the user selection, applying the at least one news-based mode of operation to the electronic device.",
                "95. The method of claim 94, wherein the detecting the wireless network comprises connecting the electronic device to the wireless network, and wherein the accessing the identification comprises downloading the identification to the electronic device from the wireless network.",
                "96. The method of claim 94, wherein the applying the at least one news-based mode of operation comprises adjusting at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "97. A system for supporting news-based modes of operation on an electronic device, the system comprising:\nmemory configured to store event information about at least one news-based event; and\nthe electronic device, the electronic device comprising:\na news detection module configured to determine at least one news condition of the electronic device; and\na control module coupled to the news detection module, wherein the control module is configured to:\naccess the stored event information about the at least one news-based event;\ncompare the at least one news condition of the electronic device to the accessed event information; and\napply at least one news-based mode of operation to the electronic device based at least in part on the comparison.",
                "98. The system of claim 97, wherein at least a portion of the memory is located on one of (the electronic device and (a server external to the electronic device.",
                "99. The system of claim 97, wherein the news detection module comprises at least one of (a 802.11 communications protocol, (an Ethernet communications protocol, (a Bluetooth communications protocol, (a high frequency system communications protocol, (an infrared communications protocol, (a transmission control protocol/internet protocol communications protocol, (a global system for mobile communications communications protocol, (an enhanced data rates for global system for mobile communications evolution communications protocol, (a code division multiple access communications protocol, (a quadband communications protocol, (a voice over internet protocol communications protocol, (a hypertext transfer protocol communications protocol, (a BitTorrent communications protocol, (a file transfer protocol communications protocol, (a rapid transport protocol communications protocol, (a real-time streaming protocol communications protocol, (a secure shell protocol communications protocol, (a rich site summary communications protocol, and a (really simple syndication protocol communications protocol.",
                "100. The system of claim 97, wherein the at least one news-based mode of operation comprises an adjustment of at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "101. A method for supporting usage-based modes of operation on an electronic device, the method comprising:\naccessing usage information associated with the electronic device;\ndetermining, based at least in part on the accessed usage information, if the electronic device is experiencing at least one usage-based event; and\nin response to determining that the electronic device is experiencing the at least one usage-based event, applying at least one usage-based mode of operation to the electronic device.",
                "102. The method of claim 101, wherein the applying to the electronic device the at least one usage-based mode of operation comprises adjusting at least one configuration characteristic of the electronic device.",
                "103. The method of claim 102, further comprising restricting the re-adjustment of the at least one configuration characteristic of the electronic device while the electronic device is experiencing the at least one usage-based event.",
                "104. The method of claim 102, wherein the at least one configuration characteristic is at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "105. The method of claim 102, wherein the adjusting the at least one configuration characteristic of the electronic device comprises one of (disabling at least one function of the electronic device and (enabling at least one function of the electronic device.",
                "106. The method of claim 105, wherein the one of disabling and enabling the at least one function respectively comprises one of (disabling at least one network interface on the electronic device and (enabling at least one network interface on the electronic device.",
                "107. The method of claim 102, wherein the adjusting the at least one configuration characteristic of the electronic device comprises adjusting at least one of (an audio setting on the electronic device and (a display setting on the electronic device.",
                "108. The method of claim 102, wherein the adjusting the at least one configuration characteristic of the electronic device comprises altering at least one asset of the electronic device.",
                "109. The method of claim 108, wherein the altering the at least one asset of the electronic device comprises one of (loading the at least one asset onto the electronic device and (removing the at least one asset from the electronic device.",
                "110. The method of claim 108, wherein the altering the at least one asset of the electronic device comprises one of (changing the priority of the at least one asset with respect to at least one other asset of the electronic device and (changing the presentation of the at least one asset.",
                "111. The method of claim 101, wherein the accessing the usage information associated with the electronic device comprises determining at least one temporal condition of the electronic device using at least one of (an event counter and (a signal strength detector.",
                "112. The method of claim 101, wherein the determining if the electronic device is experiencing the at least one usage-based event comprises:\naccessing event information;\ncomparing the accessed usage information to the accessed event information; and\ndetermining if the electronic device is experiencing the at least one usage-based event based at least in part on the comparison.",
                "113. The method of claim 112, wherein the accessing the event information comprises at least partially accessing the event information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "114. The method of claim 112, wherein the at least one usage-based event comprises at least one threshold level for at least one usage condition, and wherein the accessing the event information comprises accessing a value for the at least one threshold level.",
                "115. The method of claim 101, wherein the at least one usage-based event comprises at least two distinct ranges of values for at least one usage condition.",
                "116. The method of claim 101, wherein the applying the at least one usage-based mode of operation to the electronic device comprises:\naccessing mode information associated with the at least one usage-based event; and\napplying to the electronic device the accessed mode information, wherein, the accessing the mode information comprises at least partially accessing the mode information from at least one of (memory located on the electronic device and (a server external to the electronic device.",
                "117. The method of claim 101, further comprising backing up at least one configuration characteristic of the electronic device before the applying the at least one usage-based mode of operation to the electronic device.",
                "118. The method of claim 117, further comprising:\ndetermining when the electronic device is no longer experiencing the at least one usage-based event; and\nin response to the determining that the electronic device is no longer experiencing the at least one usage-based event, restoring to the electronic device the backed up at least one configuration characteristic.",
                "119. A method for supporting usage-based modes of operation on an electronic device, the method comprising:\ndetecting a wireless network with the electronic device;\naccessing an identification of at least one usage-based mode of operation associated with the wireless network;\npresenting a listing comprising the identification of the at least one usage-based mode of operation;\nreceiving a user selection of the at least one usage-based mode of operation from the listing; and\nin response to receiving the user selection, applying the at least one usage-based mode of operation to the electronic device.",
                "120. The method of claim 119, wherein the detecting the wireless network comprises connecting the electronic device to the wireless network, and wherein the accessing the identification comprises downloading the identification to the electronic device from the wireless network.",
                "121. The method of claim 119, wherein the applying the at least one usage-based mode of operation comprises adjusting at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device.",
                "122. A system for supporting usage-based modes of operation on an electronic device, the system comprising:\nmemory configured to store event information about at least one usage-based event; and\nthe electronic device, the electronic device comprising:\na usage detection module configured to determine at least one usage condition of the electronic device; and\na control module coupled to the usage detection module, wherein the control module is configured to:\naccess the stored event information about the at least one usage-based event;\ncompare the at least one usage condition of the electronic device to the accessed event information; and\napply at least one usage-based mode of operation to the electronic device based at least in part on the comparison.",
                "123. The system of claim 122, wherein at least a portion of the memory is located on one of (the electronic device and (a server external to the electronic device.",
                "124. The system of claim 122, wherein the usage detection module comprises at least one of (an event counter and (a signal strength detector.",
                "125. The system of claim 122, wherein the at least one usage-based mode of operation comprises an adjustment of at least one of (an input functionality of the electronic device, (an output functionality of the electronic device, (an application function of the electronic device, (a media asset of the electronic device, and (a communication asset of the electronic device."
            ]
        }
    ],
    "firstInventorToFileIndicator": "Y",
    "applicationStatusCode": 150,
    "applicationTypeCode": "UTL",
    "entityStatusData": {
        "smallEntityStatusIndicator": false,
        "businessEntityStatusCategory": "Regular Undiscounted"
    },
    "filingDate": "2014-04-08",
    "class/subclass": "455/456.3",
    "nationalStageIndicator": false,
    "firstInventorName": "Yong-Joon JEON",
    "cpcClassificationBag": [
        "H04W4/029",
        "H04M1/72457"
    ],
    "effectiveFilingDate": "2014-04-08",
    "publicationDateBag": [
        "2015-01-15"
    ],
    "publicationSequenceNumberBag": [
        "0018012"
    ],
    "earliestPublicationDate": "2015-01-15",
    "applicationTypeLabelName": "Utility",
    "applicationStatusDate": "2018-01-31",
    "class": "455",
    "applicationTypeCategory": "REGULAR",
    "applicationStatusDescriptionText": "Patented Case",
    "patentNumber": "9900731",
    "grantDate": "2018-02-20",
    "applicantBag": [
        {
            "applicantNameText": "Samsung Electronics Co., Ltd.",
            "correspondenceAddressBag": [
                {
                    "cityName": "Suwon-si",
                    "countryCode": "KR",
                    "nameLineOneText": "Samsung Electronics Co., Ltd.",
                    "countryName": "KOREA, REPUBLIC OF",
                    "postalAddressCategory": "postal"
                }
            ]
        }
    ],
    "firstApplicantName": "Samsung Electronics Co., Ltd.",
    "customerNumber": 68103,
    "groupArtUnitNumber": "2642",
    "earliestPublicationNumber": "US20150018012A1",
    "inventionTitle": "METHOD OF PROVIDING LOCATION BASED SERVICE AND ELECTRONIC DEVICE THEREOF",
    "applicationConfirmationNumber": 5639,
    "examinerNameText": "MIAH, LITON",
    "subclass": "456.3",
    "publicationCategoryBag": [
        "Granted/Issued",
        "Pre-Grant Publications - PGPub"
    ],
    "docketNumber": "0202-0924"
}